[{"url": "http://leagueoflegends.wikia.com/wiki/Aatrox", "urldoc": ["Aatrox", "the Darkin Blade", " ", " ", " or ", " ", " ", " ", "Release date", "Aatrox's secondary resource bar displays his Blood Well. Whenever he uses an ability that costs health, he stores 100% of the health cost into it. The Blood Well can store up to 30 + (45 × level) health. If Aatrox has not dealt nor received damage in the last 5 seconds, his Blood Well will deplete at a rate of 2% per second. \n", "Aatrox passively increases his attack speed by ", " / ", " / ", " / ", " / ", " / ", "% for every 2% in the Blood Well.\n", "Upon taking fatal damage, Blood Well activates and places Aatrox in stasis for up to 3 seconds. Over the stasis duration the Blood Well is emptied and Aatrox restores health equal to its contents plus 10.", " + (15.", " × level). Aatrox can cancel the stasis early after 1 second by moving, but this also ends the health regeneration.\n", "Additional Information:\n", "\n", " Aatrox takes flight and slams down at a targeted area, dealing physical damage to nearby enemies upon landing. Enemies in the center of the area are also knocked up for 1 second.\n", "Additional Information:\n", "\n", "\n", " Aatrox heals himself on every third attack. If Aatrox is below 50% health he will heal for three times as much.\n", " Aatrox deals bonus physical damage on every third attack at the cost of health.\n", "Additional Information:\n", "\n", "\n", " Aatrox unleashes and sends forward the power of his blade, dealing magic damage to enemies in a line and slowing them by 40% for a few seconds.\n", "\n", " Aatrox draws in the blood of his foes, dealing magic damage to nearby enemy champions. \n", "For the next 12 seconds, Aatrox gains bonus attack speed and 175 bonus attack range (325 total range). His attacks are still considered melee.\n", "Additional Information:\n", "\n", "\n", "\n\t", "\n\tYou can find discussions about everything related to this wiki on "]}]