[{"url": "http://leagueoflegends.wikia.com/wiki/Ahri", "urldoc": ["Ahri", "the Nine-Tailed Fox", " ", " ", " or ", " ", " ", " ", "Release date", "Ahri gains a charge of ", " with each enemy unit hit by any of her spells, with a cap of 3 charges gained per spell cast. \n", "Upon reaching 9 charges, Ahri's next spell will heal her for 2 + (Ahri's level) ", " for each enemy hit.\n", "\n", " Ahri sends out an orb in a line in front of her and then pulls it back, dealing magic damage on the way out and true damage on the way back.\n", "Additional Information:\n", "\n", " Ahri releases three fox-fires to surround her for up to 5 seconds. After a short delay after cast, each flame will target the closest visible enemy unit to itself, prioritizing champions, and deal magic damage to the target.\n", "Additional fox-fires that hit the same target will only deal 30% damage.\n", "Additional Information:\n", "\n", " Ahri blows a kiss that travels in a line in front of her. The first enemy it hits takes magic damage and is charmed, forcing them to walk harmlessly towards Ahri while being slowed by 50% for the duration.\n", "Enemies hit by ", " take 20% more magic damage from Ahri for 6 seconds. ", " true damage is also increased by this effect.\n", "Additional Information:\n", "\n", " Ahri dashes towards the cursor and fires essence bolts, dealing magic damage to up to 3 visible nearby enemies, prioritizing champions. In the next 10 seconds, ", " can be cast two additional times before going on cooldown. Each enemy can only be hit once per dash.\n", "Additional Information:\n", "\n", "\n\t", "\n\tYou can find discussions about everything related to this wiki on "]},
{"url": "http://leagueoflegends.wikia.com/wiki/Anivia", "urldoc": ["Anivia", "the Cryophoenix", " ", " ", " or ", " ", " ", " ", "Release date", "Upon taking lethal damage, Anivia will transform into an egg with 100% health. While in egg form, Anivia is unable to make any actions and her armor and magic resistance are modified by ", " / ", " / ", " / ", " / ", ". If her egg survives for 6 seconds, Anivia is revived with the same percentage health that her egg had.\n", "Additional Information:\n", "\n", " Anivia unleashes an orb of ice that travels in a line, dealing magic damage to any enemy it passes through. At maximum range, Flash Frost will detonate automatically.\n", " Anivia detonates the orb, dealing magic damage and stunning enemies in a 75-radius area for 1 second. Enemies can be damaged by both parts of ", ".\n", "Enemies damaged by ", " are Chilled for 3 seconds, slowing their movement speed by 20%.\n", "Additional Information:\n", "\n", " Anivia constructs an impassable wall of ice at the target location for 5 seconds, perpendicular to Anivia's facing. The wall grants sight in a large area around it.\n", "Additional Information:\n", "\n", " Anivia fires a shard of ice to deal magic damage to a target enemy. ", " deals double damage to enemies that are Chilled.\n", "Additional Information:\n", "\n", " Anivia creates a blizzard in a target 400-radius area, that deals magic damage every second to enemies inside. Enemies damaged by ", " are Chilled for 1 second, slowing their movement speed and attack speed by 20%.\n", "Anivia can re-activate ", " at any time to disable its effects, and it will deactivate automatically if she gets too far away. Additionally, ", " will be deactivated by all forms of interrupting crowd control, excluding fear and taunt.\n", "Additional Information:\n", "\n", "\n", "\n\t", "\n\tYou can find discussions about everything related to this wiki on "]},
{"url": "http://leagueoflegends.wikia.com/wiki/Annie", "urldoc": ["Annie", "the Dark Child", " ", " ", " or ", " ", " ", "Release date", "Every 4 spell casts, Annie's next offensive spell will stun all damaged enemies for ", " / ", " / ", " seconds.\n", "Additional Information:\n", "\n", " Annie blasts target enemy with a fireball, dealing magic damage. If Disintegrate kills the target, it refunds its mana cost.\n", "\n", " Annie scorches all enemies in a 50° conic area in front of her with fire, dealing magic damage.\n", "\n", " For 5 seconds, Annie is surrounded by a shield of fire, increasing her armor and magic resistance and dealing magic damage to enemies each time they use a basic attack against her.\n", "Additional Information:\n", "\n", " Annie summons ", " to the target location in a burst of flame, dealing magic damage to enemies within 290 range. Tibbers remains on the field for up to 45 seconds, and Annie can control his movement and attacks. \n", "Tibbers deals magical damage with his attacks, and is also surrounded by a flaming aura that deals 35 ", " magic damage every second to enemies within 200 range of himself.\n", "Additional Information:\n", "\n", "\n", "\n"]},
{"url": "http://leagueoflegends.wikia.com/wiki/Aatrox", "urldoc": ["Aatrox", "the Darkin Blade", " ", " ", " or ", " ", " ", " ", "Release date", "Aatrox's secondary resource bar displays his Blood Well. Whenever he uses an ability that costs health, he stores 100% of the health cost into it. The Blood Well can store up to 30 + (45 × level) health. If Aatrox has not dealt nor received damage in the last 5 seconds, his Blood Well will deplete at a rate of 2% per second. \n", "Aatrox passively increases his attack speed by ", " / ", " / ", " / ", " / ", " / ", "% for every 2% in the Blood Well.\n", "Upon taking fatal damage, Blood Well activates and places Aatrox in stasis for up to 3 seconds. Over the stasis duration the Blood Well is emptied and Aatrox restores health equal to its contents plus 10.", " + (15.", " × level). Aatrox can cancel the stasis early after 1 second by moving, but this also ends the health regeneration.\n", "Additional Information:\n", "\n", " Aatrox takes flight and slams down at a targeted area, dealing physical damage to nearby enemies upon landing. Enemies in the center of the area are also knocked up for 1 second.\n", "Additional Information:\n", "\n", "\n", " Aatrox heals himself on every third attack. If Aatrox is below 50% health he will heal for three times as much.\n", " Aatrox deals bonus physical damage on every third attack at the cost of health.\n", "Additional Information:\n", "\n", "\n", " Aatrox unleashes and sends forward the power of his blade, dealing magic damage to enemies in a line and slowing them by 40% for a few seconds.\n", "\n", " Aatrox draws in the blood of his foes, dealing magic damage to nearby enemy champions. \n", "For the next 12 seconds, Aatrox gains bonus attack speed and 175 bonus attack range (325 total range). His attacks are still considered melee.\n", "Additional Information:\n", "\n", "\n", "\n\t", "\n\tYou can find discussions about everything related to this wiki on "]},
{"url": "http://leagueoflegends.wikia.com/wiki/Alistar", "urldoc": ["Alistar", "the Minotaur", " ", " ", " or ", " ", " ", "Release date", "After casting a spell, for 3 seconds Alistar ignores unit collision and deals 6 + (1 × level) ", " magic damage to nearby enemy units and structures each second. Trample deals double damage to minions and monsters, dealing 12 + (2 × level) ", " damage per second.\n", "Additional Information:\n", "\n", "\n", " Alistar smashes the ground beneath him, dealing magic damage to nearby enemies and knocking them up for 1 second. Upon landing, they are stunned for 0.", " seconds.\n", "\n", " Alistar dashes to an enemy, dealing magic damage, stunning it for 1 sec while knocking it back 650 range.\n", "Additional Information:\n", "\n", "\n", " Alistar heals himself, with nearby allies healing for half that amount. Triumphant Roar's cooldown is reduced by 2 seconds whenever a nearby enemy unit dies.\n", "Additional Information:\n", "\n", "\n", " Alistar roars, removing all crowd control effects on himself. For 7 seconds afterwards, he gains bonus attack damage and takes reduced physical and magic damage.\n", "Additional Information:\n", "\n", "\n", "\n\t", "\n\tYou can find discussions about everything related to this wiki on "]},
{"url": "http://leagueoflegends.wikia.com/wiki/Blitzcrank", "urldoc": ["Blitzcrank", "the Great Steam Golem", " ", " ", " or ", " ", " ", " ", "Release date", " When Blitzcrank drops below 20% health he gains a shield equal to ", " that lasts 10 seconds.\n", "Additional Information:\n", "\n", "\n", " Blitzcrank extends his right hand in a line. The first enemy hit is pulled to his location, takes magic damage and is stunned for 1 second.\n", "Additional Information:\n", "\n", "\n", " Blitzcrank super charges himself, gaining increased movement and attack speed for 8 seconds.\n", "Additional Information:\n", "\n", "\n", " Blitzcrank supercharges his next basic attack, causing it to deal an additional ", " and knocking his target into the air for 1 second.\n", "Additional Information:\n", "\n", "\n", " Every 2.", " seconds, Blitzcrank fires a lightning bolt at a random enemy within 450 range, dealing magic damage. This effect cannot target stealthed enemies.\n", " Blitzcrank detonates his static field, dealing magic damage to nearby enemies within 600 range and silencing them for 0.", " seconds. Static Field's passive damage is disabled while its active is on cooldown.\n", "Additional Information:\n", "\n", "\n"]},
{"url": "http://leagueoflegends.wikia.com/wiki/Akali", "urldoc": ["Akali", "the Fist of Shadow", " ", " ", " or ", " ", " ", "Release date", " Akali's auto attacks deal 6% ", " bonus magic damage.\n", " Akali gains 6% ", " spell vamp.\n", " is a ", ".\n", "\n", " Akali throws her kama at a target enemy, dealing magic damage and marking the target for 6 seconds.\n", "Akali's basic attacks or ", " against a marked target will consume the mark, dealing additional magic damage again and restoring energy.\n", "The debuff can be detonated ", " or by Crescent Slash.\n", "Additional Information:\n", "\n", "\n", " Akali creates a sight-granting smoke cloud in a 300-radius area for 8 seconds. While within the cloud, Akali is stealthed and gains bonus armor and magic resistance. Attacking or using abilities reveals her for 0.", " seconds. Enemies inside the smoke are slowed.\n", "Additional Information:\n", "\n", "\n", " Akali flourishes her kamas, dealing physical damage and triggering any ", " on nearby enemies.\n", "\n", " Akali uses an Essence of Shadow, dashing to and dealing magic damage to a target enemy. Akali gains an Essence of Shadow periodically, affected by cooldown reduction, up to a maximum of 3. Additionally, gaining a kill or assist will restore an Essence of Shadow.\n", "Additional Information:\n", "\n", "\n"]},
{"url": "http://leagueoflegends.wikia.com/wiki/Brand", "urldoc": ["Brand", "the Burning Vengeance", " ", " ", " or ", " ", " ", "Release date", "Brand's spells light his targets ablaze, dealing ", " as magic damage per second for 4 seconds, for a total of ", ". Monsters take a maximum of 80 damage per second from ", " (320 total damage).\n", "Additional Information:\n", "\n", " Brand launches a fireball forward that deals magic damage to the first enemy it hits. If the target is ablaze, the target is also stunned for 2 seconds.\n", "\n", " After a 0.", " second delay, Brand creates a burst of fire at target 250-radius area, dealing magic damage to enemies inside. Units that are ablaze take an additional 25% damage.\n", "\n", " Brand blasts target opponent with fire, dealing magic damage. If the target is ablaze, the conflagration will also spread to enemies within 300 range of the target.\n", "Additional Information:\n", "\n", " Brand unleashes a devastating torrent of fire to a target that will bounce between enemies, dealing magic damage each time it bounces. If a target is ablaze, ", " next bounce will prioritize champions. It will bounce up to four times for a total of five hits, and can hit the same enemy up to three times.\n", "Additional Information:\n", "\n", "\n\t", "\n\tYou can find discussions about everything related to this wiki on "]},
{"url": "http://leagueoflegends.wikia.com/wiki/Caitlyn", "urldoc": ["Caitlyn", "the Sheriff of Piltover", " ", " ", " or ", " ", " ", "Release date", "Caitlyn's basic attacks generate 1 stack of Headshot. At ", " / ", " / ", " stacks, her next basic attack will deal bonus physical damage equal to ", ". The bonus damage is tripled against minions and monsters. Attacks from brush will grant 2 stacks of Headshot. Attacks against towers will not grant any stacks.\n", "Additional Information:\n", "\n", " After a 1 second casting time, Caitlyn fires a projectile that deals physical damage to all targets it passes through. Each target hit after the first takes 10% less damage, down to a minimum of 50% of the original damage.\n", "Additional Information:\n", "\n", "\n", " Caitlyn sets a trap at target location that arms after a brief delay. Enemy champions who come within 67.", " range of the trap will detonate it, becoming rooted and taking magic damage over 1.", " seconds. The trap also grants true sight of the target for 9 seconds.\n", "Caitlyn can set up to 3 traps and each lasts 4 minutes. Traps are visible to both allies and enemies. If she sets a trap when three are already placed, the oldest trap will deactivate itself.\n", "Additional Information:\n", "\n", "\n", " Caitlyn fires a net, knocking herself back 400 units in the opposite direction. The net will deal magic damage and slow the first enemy hit by 50%.\n", "Additional Information:\n", "\n", "\n", " After a brief delay, Caitlyn locks onto a target enemy champion and channels for 1 second. While channeling, Caitlyn gains true sight of the target. If Caitlyn completes the channel, she will fire a 3200-speed homing projectile toward the target that deals physical damage to the first enemy champion it hits.\n", "Additional Information:\n", "\n", "\n", "\n\t", "\n\tYou can find discussions about everything related to this wiki on "]},
{"url": "http://leagueoflegends.wikia.com/wiki/Cassiopeia", "urldoc": ["Cassiopeia", "the Serpent's Embrace", " ", " ", " or ", " ", " ", "Release date", "Casting a spell causes any subsequent spellcasts within 5 seconds to cost 10% less mana, stacking up to 5 times.\n", "Additional Information:\n", "\n", "\n", " Cassiopeia hurls poison at the cursor's location, which strikes after a 0.", " second delay. All enemies within the 75-radius area are poisoned, taking magic damage over 3 seconds.\n", "Cassiopeia gains a movement speed boost for 3 seconds if Noxious Blast damages a champion.\n", "Additional Information:\n", "\n", "\n", " Cassiopeia throws a growing cloud of poison to a target location, granting sight of the area and growing from a radius of 125 to 250 over 7 seconds. Enemies in the area are poisoned, becoming slowed and taking magic damage per second for 2 seconds. Continual exposure renews the poison.\n", "\n", " Cassiopeia fires fangs at an enemy, dealing magic damage. If her target is poisoned, Twin Fang's cooldown is reduced to 0.", " seconds.\n", "Additional Information:\n", "\n", "\n", " After a brief delay, Cassiopeia blasts all enemies in a 80º cone in front of her with her gaze, dealing magic damage to them. Enemies facing her when damaged are stunned for 2 seconds, while enemies facing away are slowed by 60% for 2 seconds instead.\n", "Additional Information:\n", "\n", "\n", "\n\t", "\n\tYou can find discussions about everything related to this wiki on "]},
{"url": "http://leagueoflegends.wikia.com/wiki/Amumu", "urldoc": ["Amumu", "the Sad Mummy", " ", " ", " or ", " ", " ", " ", "Release date", "Amumu's autoattacks reduce the target's magic resistance by ", " / ", " / ", " for 3 seconds. This debuff refreshes with every basic attack.\n", "\n", " Amumu tosses a sticky bandage in a straight line towards a target location. Amumu will pull himself to the enemy it contacts, dealing magic damage and stunning the target for 1 second.\n", "Additional Information:\n", "\n", "\n", " Amumu is surrounded by a small pool of damaging tears. Enemies in the area take magic damage each second equal to a base amount plus a percentage of their maximum health.\n", "Additional Information:\n", "\n", "\n", " Amumu takes reduced physical damage from autoattacks and abilities.\n", " Amumu releases his anger, dealing magic damage to surrounding enemies. Each autoattack that hits Amumu will reduce the cooldown on Tantrum's active by 0.", " seconds.\n", "Tantrum's passive is a defensive buff.\n", "Additional Information:\n", "\n", "\n", " Amumu entangles surrounding enemy units, dealing magic damage and rendering them unable to move and attack for 2 seconds.\n", "\n", "\n\t", "\n\tYou can find discussions about everything related to this wiki on "]},
{"url": "http://leagueoflegends.wikia.com/wiki/Corki", "urldoc": ["Corki", "the Daring Bombardier", " ", " ", " or ", " ", " ", "Release date", "Corki's basic attacks deal additional true damage equal to ", ". This bonus damage is not affected by critical hits, nor can it damage structures.\n", "\n", " Corki launches a bomb at a target 250-radius area, granting sight of the location as it travels and for 6 seconds afterward. Enemies within the area take magic damage and Corki gains sight of them for 6 seconds.\n", "Additional Information:\n", "\n", "\n", " Corki flies to a target location at 650 speed, dropping bombs that leave up to 3 blazing patches along his path, depending on his distance traveled. The fire lasts for 2 seconds, dealing magic damage to enemies that remain in the area every 0.", " seconds, for a maximum of 5 ticks of damage.\n", "Additional Information:\n", "\n", "\n", " Corki activates his gatling gun, spraying bullets in a 35° cone in front of him for 4 seconds. Enemies inside the cone take physical damage and have their armor reduced by a stacking amount every 0.", " seconds they remain in the gunfire.\n", "Gatling Gun does not hinder Corki's actions, and its cone will remain in front of him as he moves.\n", "\n", " Corki fires a missile in a line that explodes if it hits an enemy, dealing magic damage to all enemies within 75 range.\n", "Corki reloads a missile every few seconds, up to a maximum of 7 stored at once; this reload time is affected by cooldown reduction. Upon death, Corki will respawn with 4 missiles.\n", " Every third missile Corki fires becomes a Big One, dealing 50% additional damage and doubling its explosion range to 150.\n", "\n", "\n\t", "\n\tYou can find discussions about everything related to this wiki on "]},
{"url": "http://leagueoflegends.wikia.com/wiki/Cho%27Gath", "urldoc": ["Cho'Gath", "the Terror of the Void", " ", " ", " or ", " ", " ", " ", "Release date", "Whenever Cho'Gath kills a unit, he recovers 17 + (3 × level) health and 3.", " + (0.", " × level) mana.\n", " Cho'Gath stomps his foot, causing the ground to tremble at the target location for 0.", " seconds. Afterwards, spikes erupt from the ground knocking up all enemies in a 175-radius area for 1 seconds and dealing magic damage. Targets hit are slowed by 60% for 1.", " seconds after landing.\n", "Additional Information:\n", "\n", "\n", " Cho'Gath roars, dealing magic damage and silencing all enemies in a 60º cone area in front of him.\n", "\n", " Whenever Cho'Gath performs a basic attack, he will launch spikes dealing magic damage to enemies in a line in front of him.\n", "Additional Information:\n", "\n", "\n", " Cho'gath devours target enemy, dealing true damage. If Feast kills the target, Cho'Gath grows larger and gains extra health and basic attack range, stacking up to six times. Cho'Gath loses half of these stacks, rounded up (Lost stacks being rounded up, thus, kept stacks rounded down), whenever he dies.\n", "Feast deals 1000 ", " true damage to minions and monsters.\n", "Additional Information:\n", "\n", "\n", "\n\t", "\n\tYou can find discussions about everything related to this wiki on "]},
{"url": "http://leagueoflegends.wikia.com/wiki/Diana", "urldoc": ["Diana", "Scorn of the Moon", " ", " ", " or ", " ", " ", " ", "Release date", "Every third basic attack cleaves nearby enemies for ", " / ", " / ", " / ", " / ", " / ", " / ", " / ", " / ", " / ", " / ", " / ", " / ", " / ", " / ", " / ", " / ", " / ", " (15 + ", " / ", " / ", " / ", " / ", " at each level) ", " magic damage. The counter will reset if Diana hasn't attacked for 3.", " seconds. In addition, Diana permanently has 20% bonus attack speed.\n", "Additional Information:\n", "\n", " Diana unleashes a bolt of lunar energy that travels in an arc. Enemies struck take magic damage and are afflicted with Moonlight, granting sight of them for 3 seconds.\n", "Additional Information:\n", "\n", " Diana gains a temporary shield for 5 seconds that absorbs incoming damage. She also creates three spheres that orbit her for up to 5 seconds. The spheres detonate on contact with an enemy unit, dealing magic damage to all nearby enemies.\n", "If all three spheres detonate, the shield is reapplied and the duration is refreshed. This second shield stacks with the original shield.\n", "\n", " Diana draws in all nearby enemies to her location, slowing them for 2 seconds afterwards.\n", "Additional Information:\n", "\n", " Diana becomes the living embodiment of the vengeful moon, rushing at an enemy and dealing magic damage to it.\n", "When used to teleport to an enemy afflicted with Moonlight, Lunar Rush's cooldown is refreshed and the Moonlight debuff is consumed. All other enemies will have the Moonlight debuff removed regardless of whether they were the target of Lunar Rush.\n", "Additional Information:\n", "\n", "\n\t", "\n\tYou can find discussions about everything related to this wiki on "]},
{"url": "http://leagueoflegends.wikia.com/wiki/Dr._Mundo", "urldoc": ["Dr. Mundo", "the Madman of Zaun", " ", " ", " or ", " ", " ", " ", "Release date", "Dr. Mundo regains ", " each second.\n", "\n", " Dr. Mundo hurls his cleaver in a line. The first enemy it hits takes magic damage equal to a percentage of its current health and is slowed by 40% for 2 seconds. In addition, Dr. Mundo is healed for an amount equal to half the health cost. Infected Cleaver has a minimum damage threshold, and a maximum damage cap versus monsters and minions.\n", "Additional Information:\n", "\n", " While active, Dr. Mundo deals magic damage each second to nearby enemies and reduces the duration of crowd control effects on himself.\n", "Additional Information:\n", "\n", " For 5 seconds, Dr. Mundo gains bonus attack damage plus additional attack damage for every 1% of his missing health.\n", "Additional Information:\n", "\n", " Dr. Mundo regenerates a percentage of his maximum health over a period of 12 seconds. During this time his movement speed is increased.\n", "Additional Information:\n", "\n", "\n\t", "\n\tYou can find discussions about everything related to this wiki on "]},
{"url": "http://leagueoflegends.wikia.com/wiki/Darius", "urldoc": ["Darius", "the Hand of Noxus", " ", " ", " or ", " ", " ", " ", "Release date", "Darius' basic attacks and damaging abilities cause enemies to bleed for ", " / ", " / ", " / ", " / ", " / ", " / ", " / ", " / ", " ", " magic damage over 5 seconds. This stacks up to 5 times for a maximum of ", " / ", " / ", " / ", " / ", " / ", " / ", " / ", " / ", " ", " magic damage over the duration.\n", "Darius gains 5% movement speed for each bleeding enemy champion.\n", "\n", " Darius swings his axe, dealing physical damage to all enemies within a 425-radius area around him.\n", "Champions more than 270 units away from him are hit by his axe's blade, and will take 50% additional damage.\n", "\n", " Darius' next basic attack deals bonus physical damage and slows the target's movement and attack speed for 2 seconds.\n", "Crippling Strike's base cooldown is reduced by 1 second for each stack of Hemorrhage on the target.\n", "Additional Information:\n", "\n", "\n", " Darius gains armor penetration.\n", " After a brief delay, Darius pulls in all enemies in front of him.\n", "Additional Information:\n", "\n", "\n", " Darius leaps to an enemy champion and strikes a devastating blow, dealing true damage.\n", "For each stack of Hemorrhage on the target, Noxian Guillotine deals an additional 20% damage.\n", "When Noxian Guillotine kills the target, it can be recast within the next 20 seconds. This can occur multiple times in succession.\n", "Additional Information:\n", "\n"]},
{"url": "http://leagueoflegends.wikia.com/wiki/Draven", "urldoc": ["Draven", "the Glorious Executioner", " ", " ", " or ", " ", " ", "Release date", "When Draven catches a ", ", or kills a minion or monster, he gains one stack of Adoration. When Draven kills an enemy champion, he consumes all of his Adoration stacks and gains 50 + (2 × per stack consumed) gold. Draven loses half of his Adoration stacks upon death.\n", "Additional Information:\n", "\n", " Draven starts spinning his axe, making his next attack within 6 seconds deal bonus physical damage equal to a percentage of his total attack damage.\n", "This axe will ricochet off the target high up into the air, landing 2 seconds later at a location determined by Draven's current movement direction and speed. If Draven catches it, Spinning Axe will be applied to his next attack and he gains a stack of ", ".\n", "Draven can hold up to two Spinning Axes spinning at once.\n", "Additional Information:\n", "\n", " Draven gains increased movement speed for 1.", " seconds and increased attack speed for 3 seconds. The movement speed bonus decreases rapidly over its duration.\n", "Catching a ", " will refresh Blood Rush's cooldown.\n", "Additional Information:\n", "\n", " Draven throws his axes in a line. Enemies hit take physical damage, are knocked aside, and are slowed for 2 seconds afterwards.\n", "Additional Information:\n", "\n", " Draven hurls two massive axes in a given direction, dealing physical damage to every enemy struck.\n", "Upon reaching the edge of the map, striking an enemy champion or upon the reactivation of Whirling Death, the axes will slowly come to a stop before changing direction and returning to Draven, dealing the same damage to every enemy struck on the way back.\n", "Whirling Death deals 8% less damage for each unit hit, down to a minimum of 40%. The damage reduction resets when the axes reverse direction.\n", "Additional Information:\n", "\n"]},
{"url": "http://leagueoflegends.wikia.com/wiki/Evelynn", "urldoc": ["Evelynn", "the Widowmaker", " ", " ", " or ", " ", " ", " ", "Release date", " When out of combat for 6 seconds, Evelynn enters ", " only being able to be seen by enemy champions within 700 range or true sight. Evelynn regenerates ", " every second while stealthed.\n", "Casting spells, taking damage or dealing damage reveals Evelynn for 6 seconds.\n", "Additional Information:\n", "\n", "\n", " Evelynn fires a line of spikes through a nearby enemy, dealing magic damage to all enemy units in its path.\n", "Additional Information:\n", "\n", " Evelynn's spell hits on enemy champions grant her a flat movement speed bonus for 3 seconds. This effect stacks up to 4 times.\n", " Evelynn removes all slows affecting her, gains increased movement speed for 3 seconds and ignores unit collision. Champion kills and assists refresh Dark Frenzy's cooldown.\n", "Additional Information:\n", "\n", " Evelynn slashes a target twice, dealing physical damage with each strike. Evelynn then gains bonus attack speed for 3 seconds.\n", "Additional Information:\n", "\n", " Evelynn impales all enemy units in target 250-radius area, dealing magic damage equal to a percentage of their current health and slowing their movement speed for 2 seconds.\n", "Evelynn siphons their pain, gaining a shield that grows in strength for each enemy champion hit and lasts up to 6 seconds.\n", "Evelynn gains an ", " if Agony's Embrace hit a champion.\n", "Additional Information:\n", "\n", "\n"]},
{"url": "http://leagueoflegends.wikia.com/wiki/Fiddlesticks", "urldoc": ["Fiddlesticks", "the Harbinger of Doom", " ", " ", " or ", " ", " ", " ", "Release date", "Enemy units within 1000 range have their ", " reduced by 10.\n", " Fiddlesticks terrifies the target enemy unit, causing it to turn and flee for a short duration.\n", "\n", " Fiddlesticks creates a leash on a target enemy and channels for up to 5 seconds, dealing magic damage each second and healing himself for a percentage of the damage done. If the target moves further than 750 range of Fiddlesticks while leashed, he will stop channeling.\n", "Additional Information:\n", "\n", " Fiddlesticks throws a crow that bounces to enemy units up to 4 times, dealing magic damage and silencing for 1.", " seconds with each strike. Minions and monsters take 50% increased damage. Dark Wind may strike the same target multiple times.\n", "Additional Information:\n", "\n", " After channeling for 1.", " seconds, Fiddlesticks teleports to nearby target location with a murder of crows flying wildly around him for 5 seconds, dealing magic damage to all enemy units within 600 range each second.\n", "Additional Information:\n", "\n", "\n\t", "\n\tYou can find discussions about everything related to this wiki on "]},
{"url": "http://leagueoflegends.wikia.com/wiki/Fiora", "urldoc": ["Fiora", "the Grand Duelist", " ", " ", " or ", " ", " ", " ", "Release date", "Fiora regenerates 7 + (Fiora's level) health over 6 seconds each time she deals physical damage. Striking champions will cause this effect to stack up to 4 times.\n", "Additional Information:\n", "\n", "\n", " Fiora dashes forward to strike her target, dealing physical damage. Fiora can perform the dash a second time within 4 seconds at no mana cost.\n", "Additional Information:\n", "\n", "\n", " Fiora's attack damage is increased.\n", " Fiora parries the next basic attack within 1.", " seconds and deals magic damage to the attacker. Works against champions, monsters, and large minions.\n", "Additional Information:\n", "\n", "\n", " Fiora gains additional attack speed for 3 seconds. Each basic attack or Lunge she lands during this time increases her movement speed for 3 seconds, stacking up to 3 times.\n", "Killing a champion refreshes the cooldown on Burst of Speed. Assists reduce the cooldown by half of the base amount.\n", "Additional Information:\n", "\n", "\n", " Fiora dashes around the battlefield—becoming untargetable in the process—dealing physical damage to random enemy champion(s) 5 times. Successive hits against the same target deal 25% damage. The first and last attack will be against the same target. Each strike applies on-hit effects.\n", "Additional Information:\n", "\n", "\n"]},
{"url": "http://leagueoflegends.wikia.com/wiki/Ezreal", "urldoc": ["Ezreal", "the Prodigal Explorer", " ", " ", " or ", " ", " ", " ", "Release date", " Hitting a target with any of Ezreal's abilities increases his own attack speed by 10%. This effect lasts for 5 seconds and stacks up to 5 times.\n", "Additional Information:\n", "\n", " Ezreal fires a bolt of energy in a line that will deal physical damage and apply on-hit effects to the first enemy it hits. If it strikes an enemy unit, all of Ezreal's cooldowns will be reduced by 1 second.\n", "Additional Information:\n", "\n", " Ezreal fires a wave of energy in a line. Any enemy champions it passes through are dealt magic damage, while any allied champions it travels through have their attack speed increased for 5 seconds.\n", "Additional Information:\n", "\n", " Ezreal instantly teleports to a nearby target location and fires a homing arrow at the nearest enemy unit within 750 range, dealing magic damage to it.\n", "Additional Information:\n", "\n", " Ezreal charges for 1 second to fire a powerful broad energy missile that travels in a line across the whole map, dealing magic damage to each enemy unit it passes through. It will deal 10% less damage for each subsequent target hit, down to a minimum of 30% damage dealt.\n", "Additional Information:\n", "\n", "\n\t", "\n\tYou can find discussions about everything related to this wiki on "]},
{"url": "http://leagueoflegends.wikia.com/wiki/Galio", "urldoc": ["Galio", "the Sentinel's Sorrow", " ", " ", " or ", " ", " ", " ", "Release date", "Galio gains ", " as ability power.\n", "Additional Information:\n", "\n", "  Galio fires a concussive blast from his eyes to a target 235-radius area, dealing magic damage and slowing enemies hit for 2.", " seconds.\n", "\n", " Galio shields an allied champion or himself for 4 seconds, increasing their armor and magic resistance. Each time that unit takes damage, Galio is healed. The heal is 20% weaker than the last for each consecutive hit.\n", "Additional Information:\n", "\n", " Galio unleashes a gust of magical wind that deals magic damage to all enemies in its path. A directional draft remains for 5 seconds, increasing the movement speed of allies passing through it.\n", "Additional Information:\n", "\n", " Galio becomes a statue and channels for 2 seconds, taunting nearby foes and reducing incoming physical and magic damage by 50%.\n", "When the channel ends, Galio bursts out of his statue form, dealing magic damage to enemies within range. The damage is increased by 5% for each attack suffered while channeling (maximum 40%). If the channel is canceled, the damage radius is reduced to 575 instead of normal.\n", "While channeling, Galio can cast Bulwark on himself or on allies.\n", "Additional Information:\n", "\n", "\n\t", "\n\tYou can find discussions about everything related to this wiki on "]},
{"url": "http://leagueoflegends.wikia.com/wiki/Gangplank", "urldoc": ["Gangplank", "the Saltwater Scourge", " ", " ", " or ", " ", " ", " ", "Release date", "Gangplank's basic attacks apply a poison debuff for 3 seconds that can stack up to 3 times. Each stack deals 3 + (1 × level) magic damage per second and slows the target by 7%.\n", "Additional Information:\n", "\n", " Gangplank shoots a target enemy with his pistol, dealing physical damage. If it is killed with this ability, he gains extra gold and refunds half the mana cost. This ability can critically strike and applies on-hit effects, including his passive.\n", "Additional Information:\n", "\n", " Gangplank eats a large amount of citrus fruit, instantly removing all crowd control effects on him, as well as healing himself.\n", "Additional Information:\n", "\n", " Gangplank's attack damage and movement speed are increased permanently.\n", " Gangplank fires into the air, disabling his passive boost but inspiring himself to gain additional attack damage and movement speed, with allied champions within range receiving half that amount, for 7 seconds.\n", "Additional Information:\n", "\n", " Gangplank signals his ship to fire a cannonball barrage upon a target 600-radius area for 6 seconds, granting vision of the area and slowing enemies inside it by 25%.\n", "25 cannonballs randomly drop over the duration, each one dealing magic damage to enemies within a radius of 150.\n", "Additional Information:\n", "\n", "\n", "\n\t", "\n\tYou can find discussions about everything related to this wiki on "]},
{"url": "http://leagueoflegends.wikia.com/wiki/Garen", "urldoc": ["Garen", "the Might of Demacia", " ", " ", " or ", " ", " ", " ", "Release date", "Garen will regenerate ", " every second if he has not taken damage from any source (excluding minions) in the last 9 seconds.\n", "\n", " Garen breaks free from all slows affecting him and gains 35% movement speed for a few seconds. Additionally, his next basic attack within 4.", " seconds will deal additional physical damage and will silence his target.\n", "Additional Information:\n", "\n", " Garen's bonus armor and magic resistance are increased by 20%.\n", " Garen gains a defensive shield for a few seconds, reducing incoming damage by 30% and granting 30% crowd control reduction for the duration.\n", "Additional Information:\n", "\n", " Garen rapidly spins his sword around his body for 3 seconds, dealing physical damage each second to enemies within range. Minions take 75% damage from Judgment. Garen ignores unit collision while spinning, but moves 20% slower when traveling through minions. After 0.", " seconds, Garen can reactivate Judgment to cancel it early.\n", "Judgment can critically strike, multiplying the total AD component by (Garen's critical strike damage modifier −  50%).\n", "Additional Information:\n", "\n", " Garen calls upon the might of Demacia to attempt to execute an enemy champion, dealing magic damage plus additional damage based on his target's missing health.\n", "\n"]},
{"url": "http://leagueoflegends.wikia.com/wiki/Gragas", "urldoc": ["Gragas", "the Rabble Rouser", " ", " ", " or ", " ", " ", " ", "Release date", "Gragas takes a drink from his cask every time he uses an ability, restoring ", " over the next 4 seconds.\n", " Gragas rolls his cask to a location which will explode after 5 seconds, dealing magic damage and slowing the attack speed of nearby enemies for 3 seconds. Gragas can activate Barrel Roll again to detonate the barrel early. Gragas can active Barrel Roll again while the barrel is en route to have it detonate immediately upon arrival.\n", "Additional Information:\n", "\n", "\n", " Gragas guzzles down brew from his cask, gaining mana and starting a 1 second channel. If the channel is completed he gains additional mana and becomes empowered, increasing attack damage and reducing physical and magic damage taken for 20 seconds.\n", "Additional Information:\n", "\n", "\n", " Gragas charges forward, dealing magic damage and slowing all enemies in an area around the first enemy he hits by 35% for 2.", " seconds.\n", "If Body Slam hits an enemy, the cooldown of Body Slam is halved.\n", "Additional Information:\n", "\n", "\n", " Gragas throws his cask to a target 400-radius area, dealing magic damage to enemy units in the area and knocking them back, away from the explosion, and briefly giving vision in a 500-radius area.\n", "\n", "\n\t", "\n\tYou can find discussions about everything related to this wiki on "]},
{"url": "http://leagueoflegends.wikia.com/wiki/Elise", "urldoc": ["Elise", "the Spider Queen", " ", " ", " or ", " ", " ", " ", "Release date", "(+ 10% AP)", "When Elise's Human Form spells hit an enemy, she readies a Spiderling. While Elise is in Spider Form, she summons Spiderlings to attack nearby foes. The maximum number of Spiderlings increases with the level of ", ".\n", "Additional Information:\n", "\n", " Launches a blast of corrosive poison at target enemy, dealing magic damage equal to a base amount plus 8% ", " ", ". Damage is capped against monsters.\n", " Lunges at a target enemy with a poisonous bite, dealing magic damage equal to a base amount plus 8% ", " ", ". Damage is capped against monsters.\n", " is a single target ", ".\n", "Additional Information:\n", "\n", " Summons a venom-gorged Spiderling that moves to the target location and explodes, dealing magic damage to nearby enemies when it nears an enemy unit or after 3 seconds. If the Spiderling does not hit an enemy before reaching the target location it will re-target itself and chase down a nearby enemy, prioritizing champions. The Spiderling's movement speed increases as it gets closer to its target.\n", " ", " gain bonus attack speed.\n", " Increases the attack speed of Elise and her ", " for 3 seconds. While active, Elise heals 4 ", " health when she or her spiderlings attack.\n", "Skittering Frenzy is a ", " ability.\n", "Additional Information:\n", "\n", " Elise fires a web in a line that stuns the first enemy hit for 1.", " seconds.\n", " Elise and her ", " lift up into the air, becoming untargetable for 1 second and revealing nearby enemy targets for the duration. She then descends upon the target enemy.\n", " Elise and her ", " lift up into the air, becoming untargetable for up to 2 seconds. During that time she can cast ", " again to descend upon a targeted enemy. If no enemy is targeted within 2 seconds, she will descend at her original location.\n", " is a targeted ", ".\n", "Additional Information:\n", "\n", " Elise transforms into a menacing spider, summoning her readied ", " and granting access to arachnid abilities. While in ", ", Elise becomes melee and loses 425 range, deals bonus magic damage with her autoattacks and gains 10 movement speed.\n", "Elise begins with one rank in ", " and can increase it at levels 6, 11, and 16.\n", "Additional Information:\n", "\n", "\n"]},
{"url": "http://leagueoflegends.wikia.com/wiki/Fizz", "urldoc": ["Fizz", "the Tidal Trickster", " ", " ", " or ", " ", " ", " ", "Release date", "Fizz's dexterity allows him to ignore unit collision and take ", " / ", " / ", " / ", " / ", " / ", " reduced physical damage from auto attacks.\n", "Additional Information:\n", "\n", " Fizz dashes a fixed distance in the direction of the target enemy unit, dealing physical damage and magic damage. The physical damage applies on-hit effects and the magic damage applies on-ability effects.\n", "\n", " Fizz's auto attacks rend his target, dealing magic damage over 3 seconds that is increased based on a percentage of the target's missing health. This effect does not stack and multiple attacks will only refresh the duration. The total damage caps at 300 against minions and monsters (100 damage per second).\n", " Fizz's auto attacks are empowered for the next 5 seconds, dealing additional magic damage on-hit and applying ", " for 3 seconds.\n", "Additional Information:\n", "\n", " Fizz hops onto his trident in a nearby location, becoming untargetable for 0.", " seconds and gaining the ability to use Trickster before the effect ends.\n", "If Fizz does not use Trickster, he will slam the ground below him, dealing magic damage and slowing nearby enemies within 330 range for 2 seconds.\n", " Fizz hops off from his trident to a nearby location, dealing magic damage to nearby enemies within 270 range. Trickster does not apply a slow.\n", "Additional Information:\n", "\n", " Fizz throws a fish in a line that will bind itself onto the first enemy champion it hits. If it doesn't hit an enemy champion it will stay on an area, and it will stick to the first enemy champion that walks into the area. The fish will slow and reveal any enemy champion it is attached to.\n", "Regardless of position, after 1.", " seconds, a Shark will come out from the earth to eat the fish. If a champion has the fish attached to them they are knocked up for 1 second. All other enemies within 250 range are knocked away from the shark. All enemies hit are dealt magic damage and are slowed for 1.", " seconds afterwards.\n", "Additional Information:\n", "\n", "\n\t", "\n\tYou can find discussions about everything related to this wiki on "]},
{"url": "http://leagueoflegends.wikia.com/wiki/Hecarim", "urldoc": ["Hecarim", "the Shadow of War", " ", " ", " or ", " ", " ", " ", "Release date", "Hecarim ignores unit collision and gains bonus attack damage equal to ", " / ", " / ", " / ", " / ", " / ", " / ", " % of his bonus movement speed.\n", "Additional Information:\n", "\n", " Hecarim cleaves nearby enemies, dealing physical damage. This skill deals only 66% damage to minions and monsters.\n", "If Hecarim damages at least one enemy unit with this attack, he gains a stack of Rampage for 8 seconds, reducing the base cooldown of this ability by 1 second. This effect can stack up to 2 times.\n", "Additional Information:\n", "\n", " Hecarim surrounds himself with the spirit of dread for 4 seconds, dealing magic damage per second to all enemies within its reach. Additionally, Hecarim is healed for 20% of the damage dealt by any source to enemies within the area. Healing from damage dealt to minions or monsters are capped per cast.\n", "Additional Information:\n", "\n", " Hecarim gains 75% movement speed over the course of 3 seconds, starting with initial 25% upon cast, and ending one second afterward. While Hecarim is charging, he gains 150 extra attack range (325 total). His next attack knocks the target back, dealing physical damage based on how far Hecarim has traveled during Devastating Charge's duration.\n", "If Hecarim's target is beyond narrow terrain, Hecarim will leap over the terrain to his target.\n", "Additional Information:\n", "\n", " Hecarim summons spectral riders and charges forward with them in a line, dealing magic damage to enemies in their path. Enemies within range of where Hecarim stops will flee in terror for 1 second. \n", "The wave of spectral riders will travel the maximum distance possible in the direction of the cast, regardless of where Hecarim himself stops.\n", "Additional Information:\n", "\n", "\n\t", "\n\tYou can find discussions about everything related to this wiki on "]},
{"url": "http://leagueoflegends.wikia.com/wiki/Heimerdinger", "urldoc": ["Heimerdinger", "the Revered Inventor", " ", " ", " or ", " ", " ", " ", "Release date", "10", "15", "20", "25", "30", "35", "40", "50", "60", "70", "80", "25", "30", "35", "40", "45", "50", "55", "60", "65", "Heimerdinger grants himself, nearby allied H-28G Evolution Turrets, and nearby allied champions ", " / ", " / ", " / ", " / ", " health regeneration per 5 seconds.\n", " Heimerdinger deploys a turret at the target location. Heimerdinger stores enough parts for a new turret every several seconds (affected by cooldown reduction) but can only keep a limited number of turrets in reserve. Up to 3 turrets can be deployed at a time and deploying a fourth turret destroys the oldest one.\n", "Turrets have a short-ranged basic attack and a long-ranged laser beam. The laser beam is a pass-through skill shot that fires upon reaching 100% charge. The recharge time is 12 seconds (affected by cooldown reduction). Turrets deactivate if Heimerdinger is more than 1000 distance away for longer than 8 seconds.\n", " Heimerdinger constructs an Apex Turret that lasts for 8 seconds. The Apex Turret deals modified damage based on the rank in UPGRADE!!!; gains a 25% slow and 100% splash damage on its basic attacks; and the laser beam is wider and takes half as long to charge. The Apex Turret does not count toward Heimerdinger's turret limit, nor does it interact with his turret reserve.\n", "Additional Information:\n", "\n", "\n", " Heimerdinger unleashes a barrage of 5 rockets that converge on the target location and fan beyond it up to a maximum range, each rocket dealing magic damage to the first enemy it hits. \n", "Enemies champions and neutral monsters that are hit by more than one rocket take 20% magic damage for each rocket beyond the first. Enemy minions take modified damage from each rocket.\n", " Heimerdinger launches 4 waves of rockets in quick succession. Upgraded rockets deal modified damage based on the rank in UPGRADE!!!.\n", "Additional Information:\n", "\n", "\n", " Heimerdinger hurls a grenade at a targeted location, dealing magic damage and slowing enemies hit by 35% for 2 seconds. Enemies struck directly by the grenade are also stunned for 1.", " seconds.\n", " Heimerdinger hurls a grenade that bounces up to 3 times, discharging on each bounce. Each discharge deals modified damage based on the rank in UPGRADE!!!, the slow is increased to 80% and the area of effect is larger. Enemies can only be damaged by the grenade once, but can be slowed and stunned multiple times if circumstances permit.\n", "Additional Information:\n", "\n", "\n", " Heimerdinger empowers his next basic ability, also making it free to cast. Empowered abilities share the same cooldown as their basic form.\n", "After Heimerdinger has had UPGRADE!!! active for 3 seconds without using another ability, he can reactivate it to cancel the empowerment and put UPGRADE!!! on a 3 second static cooldown. UPGRADE!!! will only go on its normal cooldown if Heimerdinger used an empowered ability.\n", "Additional Information:\n", "\n", "\n", "\n", "\n", "\n", "\n", "\n\t", "\n\tYou can find discussions about everything related to this wiki on "]},
{"url": "http://leagueoflegends.wikia.com/wiki/Irelia", "urldoc": ["Irelia", "the Will of the Blades", " ", " ", " or ", " ", " ", " ", "Release date", "For each nearby enemy champion, Irelia reduces the duration of stuns, slows, taunts, fears, snares, immobilizes, blinds and silences.\n", "Additional Information:\n", "\n", "\n", " Irelia dashes forward to strike her target, dealing physical damage. This applies on-hit effects. If it kills the target, Bladesurge's cooldown refreshes and refunds 35 mana.\n", "Additional Information:\n", "\n", "\n", " Irelia's basic attacks restore health.\n", " Irelia's basic attacks deal additional true damage for 6 seconds. Hiten Style's passive on-hit health restore is doubled for the duration.\n", "Additional Information:\n", "\n", "\n", " Irelia pierces her target, dealing magic damage and slowing the target by 60% for the duration. If the target has a higher health % than Irelia, she stuns the target for the same duration instead.\n", "\n", " Irelia summons 4 spirit blades and fires one in a line towards the cursor, dealing physical damage to enemies it passes through. Irelia is healed for 25% of the damage dealt to champions and 10% of the damage dealt to minions and monsters.\n", "Within the next 15 seconds, Transcendent Blades can be used up to three more times at no cost.\n", "Additional Information:\n", "\n", "\n"]},
{"url": "http://leagueoflegends.wikia.com/wiki/Janna", "urldoc": ["Janna", "the Storm's Fury", " ", " ", " or ", " ", " ", " ", "Release date", "The wind aids Janna's nearby allies, increasing their movement speed by 5%.\n", "\n", " Janna summons a mighty whirlwind. For the next three seconds, she can then reactivate the spell to release the storm. On release the storm will fly in the direction it was cast, dealing magic damage to enemies and knocking them into the air for 0.", "-1. The damage done, knock up duration and distance traveled by the whirlwind increase for each second it channels.{up to 3 seconds}\n", "\n", " Janna is aided by a wind elemental, gaining movement speed and ignoring unit collision.\n", " Janna launches the elemental to deal magic damage and slow an enemy's movement speed for 3 seconds (capped at 80% total). She loses the ability's passive benefits while it is on cooldown.\n", "Additional Information:\n", "\n", " Janna surrounds a target ally with a wind shield that absorbs incoming damage for 5 seconds. While the shield persists, the target will also gain an attack damage bonus.\n", "This ability can be used on turrets. If a shielded turret kills an enemy champion, Janna will receive the kill.\n", "\n", " Janna emits a powerful blast of wind, knocking back enemies within 875 range and then channels, releasing curing winds that heal allies within 875 range every half-second for 3 seconds.\n", "Additional Information:\n", "\n", "\n\t", "\n\tYou can find discussions about everything related to this wiki on "]},
{"url": "http://leagueoflegends.wikia.com/wiki/Graves", "urldoc": ["Graves", "the Outlaw", " ", " ", " or ", " ", " ", "Release date", "Graves gains ", " / ", " / ", " bonus armor and magic resistance every second he remains in combat. This bonus stacks up to 10 times. Graves is considered in combat if he has dealt or received damage in the last 3 seconds.\n", "Additional Information:\n", "\n", " Graves fires three bullets in a cone, dealing physical damage to all enemies in their path. Enemies at close range can be hit by multiple projectiles, but each bullet beyond the first will deal only 35% damage.\n", "\n", " Graves fires a smoke canister at the target area, dealing magic damage upon landing and creating a cloud of smoke  250 wide for 4 seconds. Enemies inside the smoke cloud will be slowed and will have their vision reduced to 675 range; everything else will look like it is in the Fog of War.\n", "Additional Information:\n", "\n", " Graves dashes forward, gaining an attack speed boost for 4 seconds. Using autoattacks on enemy units, but not structures, lowers the cooldown of Quickdraw by 1 second each autoattack.\n", "\n", " Graves fires an explosive shell in a straight line, dealing heavy physical damage to the first champion it hits (also damages non-champion enemies whilst in flight). After hitting a champion or reaching the end of its range, the shell explodes dealing physical damage in a cone behind the target.\n", "Additional Information:\n", "\n", "\n\t", "\n\tYou can find discussions about everything related to this wiki on "]},
{"url": "http://leagueoflegends.wikia.com/wiki/Ashe", "urldoc": ["Ashe", "the Frost Archer", " ", " ", " or ", " ", " ", " ", "Release date", "If Ashe has not attacked in the last 3 seconds, she gains ", " / ", " / ", " / ", " / ", " Focus stacks per second. At 100 stacks, Ashe will critically strike on her next basic attack. Thereafter, Focus stacks will reset to an amount equal to her critical strike chance.\n", "Additional Information:\n", "\n", "\n", " Ashe enchants her basic attacks with ice, slowing her targets for 2 seconds.\n", "Additional Information:\n", "\n", "\n", " Ashe fires 7 arrows in a 57.", "º cone, dealing physical damage to each target hit. Each arrow will only hit one enemy, and each enemy will only be hit by one arrow. Volley also applies the current rank of ", ", regardless of whether it is toggled on or not.\n", "Additional Information:\n", "\n", "\n", " Ashe gains 3 bonus gold each time she kills a unit or destroys a structure.\n", " Ashe animates a hawk to scout for her, granting sight for 2 seconds as it flies towards a target location. Hawkshot grants a 1000-radius area of sight for 5 seconds when it reaches its destination. The sight extends into brushes.\n", "Hawk Shot also ", " grants an ", ".\n", "Additional Information:\n", "\n", "\n", " Ashe fires a giant arrow in a straight line. If it hits an enemy champion, it will deal magic damage and stun that champion for ", " second(s), based on the distance the arrow traveled. Additionally, enemies within a 250 radius of the impact take half the damage and are slowed by 50% for 3 seconds.\n", "Additional Information:\n", "\n", "\n", "\n\t", "\n\tYou can find discussions about everything related to this wiki on "]},
{"url": "http://leagueoflegends.wikia.com/wiki/Jayce", "urldoc": ["Jayce", "the Defender of Tomorrow", " ", " ", " or ", " ", " ", " ", "Release date", "Jayce gains 40 bonus movement speed for 1.", " seconds and ignores unit collision each time ", " ", " is cast.\n", "\n", " Jayce leaps to an enemy and smashes them, dealing physical damage to his target and to enemies around it, and then slowing them for 2 seconds.\n", " Jayce fires an orb of electricity that detonates upon hitting an enemy or reaching the end of its path, dealing physical damage to all enemies in the area of the explosion.\n", "If Shock Blast is fired through an ", " the area of effect, missile speed, range and damage will increase by 40%.\n", "Shock Blast is a ", ".\n", "Additional Information:\n", "\n", "\n", " Jayce regenerates mana each time he strikes an enemy while in ", ".\n", " Jayce is surrounded by an electric field, dealing magic damage over 4 seconds to nearby enemies.\n", " Jayce gains the max amount of attack speed (2.", " attacks per second) for his next 3 attacks. These attacks deal varied damage depending on rank.\n", "Hyper Charge is a self-targeted ", ".\n", "Additional Information:\n", "\n", " Jayce swings his hammer at target enemy, knocking them back and dealing magic damage equal to a percentage of the target's maximum health plus Jayce's bonus attack damage. This damage is capped against monsters.\n", " Deploys an Acceleration Gate for 4 seconds, increasing the movement speed of all allies who pass through it for 3 seconds. This bonus fades over the duration.\n", "Acceleration Gate is a ", " ability.\n", "Additional Information:\n", "\n", " Transforms the Mercury Hammer into the Mercury Cannon, gaining new abilities and ranged attacks. Jayce gains 375 range, for a total of 500 range.\nThe next attack in Cannon Stance reduces the enemy's armor and magic resist for 5 seconds.\n", " Transforms the Mercury Cannon into the Mercury Hammer, gaining new abilities, melee attacks, and bonus armor and magic resist.\n", "The next attack in Hammer Stance deals additional magic damage.\n", "\nJayce begins with one rank in Transform and can increase it at levels 6, 11, and 16 up to 4 ranks.\n", "Additional Information:\n", "\n", "\n\t", "\n\tYou can find discussions about everything related to this wiki on "]},
{"url": "http://leagueoflegends.wikia.com/wiki/Jax", "urldoc": ["Jax", "Grandmaster at Arms", " ", " ", " or ", " ", " ", " ", "Release date", "Basic attacks increase Jax's attack speed by ", " / ", " / ", " / ", " / ", " / ", ". Relentless Assault lasts for 2.", " seconds and stacks up to 6 times for a maximum of ", " / ", " / ", " / ", " / ", " / ", ".\n", "Additional Information:\n", "\n", " Jax leaps to target unit, dealing physical damage if the target is an enemy.\n", "Additional Information:\n", "\n", " Jax's next basic attack or Leap Strike within the next 10 seconds deals additional magic damage. Empower resets the autoattack timer.\n", "Additional Information:\n", "\n", " For up to 2 seconds, Jax dodges all basic attacks and takes 25% less damage from area of effect abilities. At the end of the duration or if ", " is activated again, Jax deals physical damage and stuns nearby enemies for 1 second. This spell deals 20% additional damage for each attack dodged to a maximum of 100% increased damage.\n", "Additional Information:\n", "\n", " Jax deals additional magic damage on every third basic attack. The counter will reset if he does not attack for 2.", " seconds.\n", " Jax gains bonus armor and magic resistance for 8 seconds.\n", "Additional Information:\n", "\n", "\n\t", "\n\tYou can find discussions about everything related to this wiki on "]},
{"url": "http://leagueoflegends.wikia.com/wiki/Jinx", "urldoc": ["Jinx", "the Loose Cannon", " ", " ", " or ", " ", " ", "Release date", "Whenever a champion or tower that Jinx has dealt damage to within the last 3 seconds is killed or destroyed, she gains 175% movement speed that decays over 4 seconds.\n", "Additional Information:\n", "\n", " Jinx's basic attacks grant bonus attack speed for 2.", " seconds, stacking up to 3 times. The stacks decay one at a time when she stops attacking with her minigun.\n", "Switching to her Rocket Launcher will not clear any active stacks, but they will not grant attack speed after her first attack.\n", "\n", " Jinx gains bonus attack range and deals ", " bonus damage on her attacks, at the cost of mana per attack.\n", "Additionally, her attacks will splash, dealing full damage to all enemies in a ~150-radius area. The bonus damage to her target and the splash damage both scale additively with critical strikes.\n", "Additional Information:\n", "\n", " After a short delay, Jinx fires a shock blast that deals physical damage to the first enemy hit, also granting sight and slowing it for 2 seconds.\n", "Additional Information:\n", "\n", " Jinx tosses out 3 chompers that, after an arm time of 0.", " seconds, explode on contact with enemy champions dealing magic damage over 1.", " seconds to enemies within ~50-unit area. The champion that sets off the chomper is also rooted the same duration. Chompers explode automatically after 5 seconds. A single champion can only set off a single chomper, but can be damaged by any number if they remain in range.\n", "Additional Information:\n", "\n", " Jinx fires a rocket that travels in a line, exploding on the first enemy champion hit. Enemies caught in the explosion take physical damage equal to a base amount (this amount increases over the first second the rocket travels) plus a percentage of their missing health (max. 300 vs. minions and monsters", "). The primary target of the explosion takes full damage, while nearby enemies take 80% damage.\n", "Additional Information:\n", "\n", "\n\t", "\n\tYou can find discussions about everything related to this wiki on "]},
{"url": "http://leagueoflegends.wikia.com/wiki/Karma", "urldoc": ["Karma", "the Enlightened One", " ", " ", " or ", " ", " ", " ", "Release date", "Damaging enemy champions with Karma's abilities refreshes 2 seconds of Mantra's cooldown, and half that amount on basic attacks against enemy champions.\n", "Additional Information:\n", "\n", " Karma fires a ball of energy that detonates on hitting an enemy, dealing magic damage and slowing surrounding enemies by 25% for 1.", " seconds.\n", "If it hits an unseen enemy, the detonation effect will still be visible.\n", " Inner Flame deals bonus magic damage and leaves a ", "-radius AoE that slows enemies inside by 50%. After 1.", " seconds the area detonates, dealing magic damage to enemies inside. If Inner Flame does not strike a target, the area is created at maximum range.\n", "\n", "\n", " Karma forms a 650-range tether to target enemy champion, revealing and dealing magic damage to the target over 2 seconds at 0.", "-second intervals. If the tether is not broken after the 2 seconds, the target is rooted for a short time.\n", " Focused Resolve deals bonus damage and heals Karma for 20% ", " of her missing health upon casting and another 20% ", " if the leash is not broken.\n", "\n", "Additional Information:\n", "\n", " Karma shields a target ally for 4 seconds and grants the target bonus movement speed for 1.", " seconds.\n", " The shield overflows with energy, granting ally champions within 700 range of the target half the shield value and 60% bonus movement speed for 1.", " seconds, while dealing magic damage to enemies within 600 range of the target.\n", "\n", "Additional Information:\n", "\n", " Karma empowers her next ability cast within the next 8 seconds, adding an additional effect. Empowered abilities share the same cooldown as their basic form.\n", "Karma begins with one rank in Mantra and can increase it at levels 6, 11, and 16.\n", "Ranks in Mantra improve the additional effects of empowered abilities.\n", "Additional Information:\n", "\n", "\n\t", "\n\tYou can find discussions about everything related to this wiki on "]},
{"url": "http://leagueoflegends.wikia.com/wiki/Karthus", "urldoc": ["Karthus", "the Deathsinger", " ", " ", " or ", " ", " ", "Release date", "Upon dying, Karthus enters a spirit form and becomes immobile and untargetable, allowing him to continue casting spells for 7 seconds. During this time, his abilities cost no mana.\n", "Additional Information:\n", "\n", " After a 0.", " second delay, Karthus creates an explosion at target 50-radius area. Enemies hit take magic damage, and this damage is doubled if Lay Waste only hits one unit.\n", "Additional Information:\n", "\n", " Karthus creates a wall of energy between 2 obelisks at target position for 5 seconds. Enemies who pass this wall have their movement speed reduced by a large amount and their magic resistance reduced by 15% for 5 seconds.\n", "Additional Information:\n", "\n", " When Karthus kills a unit, he restores mana.\n", "\n", " Karthus surrounds himself with the souls of his victims, draining his mana to deal magic damage to enemies in range each second.\n", "Additional Information:\n", "\n", " After channeling for 3 seconds, Karthus blasts all enemy champions regardless of their position on the map, dealing magic damage.\n", "Additional Information:\n", "\n", "\n\t", "\n\tYou can find discussions about everything related to this wiki on "]},
{"url": "http://leagueoflegends.wikia.com/wiki/Kha%27Zix", "urldoc": ["Kha'Zix", "the Voidreaver", " ", " ", " or ", " ", " ", "Release date", "When Kha'Zix is not visible to the enemy team, he gains Unseen Threat. Unseen Threat causes his next basic attack against an enemy champion to deal ", " / ", " / ", " / ", " / ", " / ", " / ", " / ", " / ", " / ", " / ", " / ", " / ", " / ", " / ", " / ", " / ", " / ", " (10 + ", " / ", " / ", " / ", " at each level) ", "  bonus magic damage and slow by 25% for 2 seconds.\n", "Unseen Threat lasts until consumed and has no internal cooldown.\n", " Kha'Zix marks enemies that are isolated from their allies.\n", " Kha'Zix slashes, dealing physical damage to a single enemy. If the target was isolated, the damage dealt is increased by 45%.\n", "Increases range of Taste Their Fear and autoattacks by 50. Additionally, Taste Their Fear now deals an additional ", " as bonus damage (max 100 vs monsters). Against isolated targets this damage is increased by 45% to ", ".\n", " Kha'Zix fires a cluster of spikes in a line that explode on contact with an enemy, dealing physical damage to all nearby enemies and slowing them by 20% for 2 seconds. Kha'Zix is healed if he is within the explosion radius.\n", "\n", "Enhances Void Spike to fire three spikes in a cone and increases the slow to 30%. Multiple explosions upon the same enemy do not deal extra damage.\n", " Kha'Zix leaps to an area, dealing physical damage to nearby enemies upon landing.\n", "\n", "Increases Leap's range by 300, and causes kills and assists scored by Kha'Zix to refresh Leap's cooldown.\n", " Each rank of Void Assault allows Kha'Zix to evolve one of his abilities, granting it an additional effect.\n", "\n", " Kha'Zix enters stealth for 1 second, gaining 40% bonus movement speed and ignores unit collision while stealthed. ", " is also granted (even if Kha'Zix is revealed through stealth). Void Assault can be cast a second time within 10 seconds at no cost.\n", "\n", "Allows Void Assault to be cast up to three times and stealth duration increased by 1 second. Kha'Zix takes 50% reduced damage while in stealth.\n", "\n\t", "\n\tYou can find discussions about everything related to this wiki on "]},
{"url": "http://leagueoflegends.wikia.com/wiki/Kayle", "urldoc": ["Kayle", "the Judicator", " ", " ", " or ", " ", " ", " ", "Release date", "Kayle's autoattacks against enemy champions reduce their armor and magic resistance by 3% for 5 seconds. This debuff stacks up to 5 times.\n", "Additional Information:\n", "\n", " Kayle blasts a target enemy, dealing magic damage, slowing its movement speed for 3 seconds and applying a stack of Holy Fervor.\n", "\n", " Blesses a target allied champion, healing them and increasing their movement speed for 3 seconds.\n", "Additional Information:\n", "\n", " Kayle ignites her sword and becomes ranged for 10 seconds, granting her bonus magic damage on her attacks and increasing her attack range by 400 (525 total range). Additionally, attacks on non-tower units damage other enemies within 150 range of the target.\n", "Additional Information:\n", "\n", " Kayle bathes a target ally champion or herself in holy light, rendering the champion immune to all damage for a few seconds.\n", "Additional Information:\n", "\n", "\n\t", "\n\tYou can find discussions about everything related to this wiki on "]},
{"url": "http://leagueoflegends.wikia.com/wiki/Kassadin", "urldoc": ["Kassadin", "the Void Walker", " ", " ", " or ", " ", " ", " ", "Release date", "\n", "Kassadin takes 15% reduced magic damage after magic resistance reductions have been applied. Kassadin converts each point of this ignored damage into 1% bonus attack speed for 4 seconds. This bonus attack speed stacks indefinitely, with the duration refreshing each time Kassadin takes magic damage.\n", " Kassadin fires an ethereal bolt of void energy at a single enemy, dealing magic damage and silencing the target for a short duration.\n", "\n", " Kassadin's melee attacks restore mana. This effect returns triple the mana when striking champions.\n", " Kassadin's basic attacks deal bonus magic damage for 5 seconds.\n", "\n", " Kassadin draws energy from spells cast in his vicinity, gaining a charge whenever a spell is cast near him, including his own spells. \n", " Upon reaching 6 charges, Kassadin can emit a pulse of void energy, dealing magic damage and slowing enemies in a 80º cone in front of him for 3 seconds.\n", "\n", " Kassadin uses his void powers to blink to a nearby location, creating a blast of void energy that deals magic damage to enemy units within 150 range of the destination area. Each subsequent Riftwalk in the next 8 seconds will cost 100 additional mana (but refunds 50% of the total mana cost when Riftwalk damages an enemy champion) and will deal additional damage. The cost and damage increase can stack up to 10 times.\n", "\n", "\n", "Kassadin takes 15% reduced magic damage and ignores unit collision.\n", " Kassadin fires an orb of void energy at a target enemy, dealing magic damage and interrupting channels. The excess energy forms around himself, granting a shield that absorbs magic damage for 1.5 seconds.\n", " Kassadin's basic attacks deal 20 ", " bonus magic damage on-hit.\n", " Kassadin charges his Nether Blade, causing his next basic attack to deal bonus magic damage and restore a percentage of his missing mana. Mana restored is greatly increased against champions.\n", " Kassadin draws energy from spells cast in his vicinity, gaining a charge whenever a spell is cast near him, including his own spells. \n", " Upon reaching 6 charges, Kassadin can emit a pulse of void energy, dealing magic damage and slowing enemies in a 80º cone in front of him for 3 seconds.\n", " Kassadin teleports to a nearby location, dealing magic damage to enemy units within 150 range upon arrival.\n", "Each subsequent Riftwalk within the next 12 seconds costs double the mana and deals bonus damage, stacking up to 4 times.\n", "\n\t", "\n\tYou can find discussions about everything related to this wiki on "]},
{"url": "http://leagueoflegends.wikia.com/wiki/Kog%27Maw", "urldoc": ["Kog'Maw", "the Mouth of the Abyss", " ", " ", " or ", " ", " ", " ", "Release date", "Upon dying, Kog'Maw starts a chain reaction in his body which causes him to gain up to 40% movement speed gradually over the duration of 4 seconds and detonate; dealing 100 + (25 × level) true damage to surrounding enemies.\n", "Additional Information:\n", "\n", "\n", " Increases Kog'Maw's attack speed.\n", " Kog'Maw launches a corrosive projectile which deals magic damage and reduces the target's Armor and Magic Resist for 4 seconds.\n", "The ability also grants a permanent ", ".\n", "\n", " For 8 seconds, Kog'Maw's attacks gain range and deal a percentage of the target's maximum health as additional magic damage. The bonus damage caps at 100 against minions and monsters.\n", "\n", " Kog'Maw launches a ball of ooze that deals magic damage and slows all enemies in a line for 1 second. The ooze lingers for 4 seconds, slowing enemies who stand on it for 0.25 seconds.\n", "\n", " Kog'Maw launches a ball of acid into the air that drops after 0.", " seconds at target 100-radius area, damaging and granting sight enemies hit for 4 seconds. Enemy champions take 125% extra base damage.\nEach subsequent Living Artillery in the next 6 seconds after a cast will cost 40 additional mana, capping at 400 per cast.\n", "Additional Information:\n", "\n", "\n", "\n\t", "\n\tYou can find discussions about everything related to this wiki on "]},
{"url": "http://leagueoflegends.wikia.com/wiki/Jarvan_IV", "urldoc": ["Jarvan IV", "the Exemplar of Demacia", " ", " ", " or ", " ", " ", " ", "Release date", "Jarvan IV's first attack on a target deals  ", " as bonus physical damage. This caps at 400 damage. This effect cannot occur on the same target more than once every 6 seconds.\n", "\n", " Jarvan IV extends his lance in a straight line, dealing physical damage and lowering the armor of all enemies hit for 3 seconds. Additionally, if it encounters his Demacian Standard, it will pull Jarvan to it, knocking up enemies within 180 range along his path for 0.", " seconds.\n", "Additional Information:\n", "\n", " Jarvan IV slows enemies within range for 2 seconds and shields himself for up to 5 seconds. The shield gains strength for each enemy champion within range upon activation.\n", "Additional Information:\n", "\n", "\n", " Permanently grants Jarvan IV bonus armor and attack speed.\n", " Jarvan IV throws a Demacian flag to the target location, dealing magic damage to enemies within ", " range. The flag will remain for 8 seconds, providing an aura that increases the attack speed of allies within a radius of ", ".\n", "Additional Information:\n", "\n", " Jarvan IV leaps to an enemy champion, dealing physical damage to it and creating a 325-radius circle of impassable terrain around themselves. This circle lasts for 3.", " seconds and also grants sight within 825 range. Jarvan IV can prematurely destroy the impassable terrain by activating this ability again.\n", "Additional Information:\n", "\n"]},
{"url": "http://leagueoflegends.wikia.com/wiki/LeBlanc", "urldoc": ["LeBlanc", "the Deceiver", " ", " ", " or ", " ", " ", " ", "Release date", "Whenever LeBlanc is below 40% health, she will become stealthed for 0.", " seconds. When the stealth ends, she creates a controllable clone of herself for 8 seconds with 53 + (17 × level) less health.\n", "Additional Information:\n", ":\n", "\n", " LeBlanc projects an orb towards her target, dealing magic damage and marking the target for 3.", " seconds. If the target takes damage from one of LeBlanc's abilities, the mark will trigger, dealing bonus magic damage and silencing the target for 1.", " seconds.\n", "Additional Information:\n", "\n", " LeBlanc rapidly dashes to a target location, damaging enemies within a 250-radius area and leaving behind a return pad. LeBlanc can activate Distortion again in the following 3 seconds.\n", " LeBlanc blinks to the return pad.\n", "Additional Information:\n", "\n", " LeBlanc flings illusionary chains in a line towards a target location. If it hits an enemy unit, it will deal initial magic damage and leash to it, slowing their movement speed by 25% while the leash remains. \n", "If the target remains within 1000 units for the full 1.", " seconds, the target takes additional magic damage and is rooted for 1.", " seconds.\n", "Additional Information:\n", "\n", " LeBlanc casts the previous spell she cast. The mimicked spell's effects are the same but the damage is replaced with a different amount based on the rank of ", ".\n", "Additional Information:\n", "\n", "\n", "\n\t", "\n\tYou can find discussions about everything related to this wiki on "]},
{"url": "http://leagueoflegends.wikia.com/wiki/Leona", "urldoc": ["Leona", "the Radiant Dawn", " ", " ", " or ", " ", " ", " ", "Release date", "Leona's spells charge any enemy unit damaged with Sunlight for 3.", " seconds. When allied champions deal any damage to those targets they consume the Sunlight debuff to deal ", " / ", " / ", " / ", " / ", " / ", " / ", " / ", " / ", " additional magic damage. This additional damage is counted as the ally's damage and it will benefit from their magic penetration. Leona is unable to activate the additional damage herself.\n", "Additional Information:\n", "\n", " Leona's next basic attack will be a shield slam, dealing additional magic damage and stunning the target for 1.", " seconds.\n", "Aditionally, increases Leona's basic attack ", " by 30 (to 155) while the effect is active.\n", "Additional Information:\n", "\n", " Leona surrounds herself with a shield of sunlight, gaining bonus armor and magic resistance for 3 seconds. When the effect ends the shield bursts, dealing magic damage to enemies within 275 range of her. If Eclipse damages any enemies, the bonuses remain for an additional 3 seconds.\n", "Additional Information:\n", "\n", " Leona projects a solar image of her sword, dealing magic damage to all enemies in a line. Leona will dash to the last enemy champion struck, briefly immobilizing them as she travels.\n", "Additional Information:\n", "\n", " Leona calls down a beam of solar energy to a target location. After a 0.", " delay, it deals magic damage to all enemies within 250 range and slows them by 80% for 1.", " seconds. Enemies within 100 range are stunned for 1.", " seconds instead of slowed.\n", "For the duration, the beam also grants vision in a radius of 350.\n", "Additional Information:\n", "\n", "\n\t", "\n\tYou can find discussions about everything related to this wiki on "]},
{"url": "http://leagueoflegends.wikia.com/wiki/Kennen", "urldoc": ["Kennen", "the Heart of the Tempest", " ", " ", " or ", " ", " ", " ", "Release date", "Enemies hit by Kennen's abilities receive one Mark of the Storm, which lasts for 6.", " seconds. These marks stack and upon receiving 3 Marks of the Storm, they detonate to stun the target for 1 second and grant Kennen 25 energy. If the stun is applied more than once within 7 seconds, it has a diminished effect and will only stun for approximately 0.", " seconds\n", "Additional Information:\n", "\n", " Kennen throws a charged shuriken in a line in front of him, dealing magic damage to the first enemy that it hits.\n", "\n", " Every fifth basic attack will deal extra magic damage proportional to Kennen's attack damage.\n", " Sends a surge of electricity through all nearby enemies afflicted by Mark of the Storm, dealing magic damage.\n", "Additional Information:\n", "\n", " Kennen transforms into a ball of electricity ignoring unit collision and gaining 100% base movement speed for 2 seconds. Any enemies he passes through take magic damage, dealing half damage to minions and monsters. Kennen also gains 40 energy from the first enemy he hits. Kennen cannot use basic attacks while Lightning Rush is active.\n", "Additionally, for 4 seconds Kennen's armor and magic resistance are increased. While Lightning Rush is active, Kennen can activate it again to cancel the first part of the ability.\n", "Additional Information:\n", "\n", " Kennen summons a magical storm around himself that zaps a random enemy champion within range every fraction of a second, dealing magic damage. The storm hits several times, increasing with level, and cannot hit the same target more than 3 times.\n", "Additional Information:\n", "\n", "\n\t", "\n\tYou can find discussions about everything related to this wiki on "]},
{"url": "http://leagueoflegends.wikia.com/wiki/Lucian", "urldoc": ["Lucian", "the Purifier", " ", " ", " or ", " ", " ", "Release date", "After using an ability, Lucian's next auto attack within 6 seconds will strike twice. The second shot deals ", ", but fully applies on-hit effects. Minions and monsters take full damage from the second shot. The second shot can critically strike. If the target is killed before the second shot can go off, the second shot will automatically shoot at something else.\n", "Additional Information:\n", "\n", "\n", " After a 0.", " second delay, Lucian fires a laser in the direction of the target enemy, dealing physical damage to all enemies in a 1100-unit line. Minions take 75% damage.\n", "Additional Information:\n", "\n", "\n", " Lucian fires a shot that explodes in a cross pattern upon hitting an enemy or reaching the end of its path, dealing magic damage and marking enemies hit for 6 seconds.\n", "If Lucian damages a marked target with his basic attacks or abilities, he gains 40 movement speed for 2 seconds. This does not consume the mark.\n", "Additional Information:\n", "\n", "\n", " Lucian dashes a short distance and removes all slowing effects. Relentless Pursuit's cooldown resets if Lucian scores a kill during The Culling.\n", "Additional Information:\n", "\n", "\n", " Lucian starts firing shots in the target direction for 3 seconds, each shot dealing physical damage to the first enemy it hits. The number of shots fired scales with his attack speed. The Culling deals quadruple damage to minions but ", " monsters. \n", "While using The Culling, Lucian's basic attacks are disabled and he cannot activate Piercing Light or Ardent Blaze. He can, however, move freely and activate Relentless Pursuit. \n", "The Culling can be reactivated to end the effect early and it is interrupted by crowd control effects that inhibit basic attacks.\n", "Additional Information:\n", "\n", "\n", "\n\t", "\n\tYou can find discussions about everything related to this wiki on "]},
{"url": "http://leagueoflegends.wikia.com/wiki/Lee_Sin", "urldoc": ["Lee Sin", "the Blind Monk", " ", " ", " or ", " ", " ", " ", "Release date", "After using an ability, Lee Sin's next 2 basic attacks within 3 seconds gain 40% attack speed and return 15 energy each.\n", "Additional Information:\n", "\n", " Lee Sin shoots a wave of sound in a line, dealing physical damage to the first enemy it hits and granting true sight of it for 3 seconds. If Sonic Wave hits, Lee Sin can cast Resonating Strike within the next 3 seconds.\n", "\n", " Lee Sin dashes to the enemy marked by Sonic Wave, dealing physical damage including 8% of the target's missing health. Minions and monsters take a maximum of 400 damage.\n", "Additional Information:\n", "\n", " Lee Sin dashes to a target ally, gaining a shield that absorbs a certain amount of damage. If the ally is a champion, they will also gain a shield. Each shield dissipates after 5 seconds if not already destroyed. Lee Sin can cast Iron Will within 3 seconds of using Safeguard.\n", "\n", " For 5 seconds, Lee Sin gains bonus life steal and spell vamp.\n", "Additional Information:\n", "\n", " Lee Sin smashes the ground, dealing magic damage to all nearby enemies and granting true sight of them for 4 seconds. If Tempest hits an enemy, Lee Sin can cast Cripple within the next 3 seconds.\n", "\n", " Lee Sin cripples all enemies within range that are marked by Tempest, reducing their movement and attack speed. The movement and attack speed recover over 4 seconds.\n", "Additional Information:\n", "\n", " Lee Sin launches a powerful roundhouse kick, dealing physical damage to a target champion and knocking it back 1200 units over 1 second. Enemies the target collides with take the same damage and are knocked airborne for 1 second.\n", "Additional Information:\n", "\n", "\n\t", "\n\tYou can find discussions about everything related to this wiki on "]},
{"url": "http://leagueoflegends.wikia.com/wiki/Lissandra", "urldoc": ["Lissandra", "the Ice Witch", " ", " ", " or ", " ", " ", "Release date", "Every 18 seconds, Lissandra's next ability costs no mana. Cooldown reduction does not affect Iceborn, but the cooldown is reduced by 1 second whenever Lissandra impairs an enemy's movement with an ability (does not apply to movement-impairing effects from items).\n", "Additional Information:\n", "\n", " Throws a spear of ice that travels in a line and shatters when it hits an enemy, dealing magic damage and slowing its movement speed for 1.", " seconds. Shards then pass through the target, dealing the same damage to other enemies hit (but not slowing them).\n", "Additional Information:\n", "\n", " Freezes an area around Lissandra, dealing magic damage to nearby enemies and rooting them for a short time.\n", "Additional Information:\n", "\n", " Casts a claw of ice that moves forward in a line, dealing magic damage to all enemies hit. Reactivating this ability transports Lissandra to the claw's current location.\n", "Additional Information:\n", "\n", " Freezes target champion solid, dealing magic damage and stunning it for 1.", " seconds.\n", " Lissandra encases herself in a glacier for 2.", " seconds, becoming untargetable and invulnerable but unable to take any actions.\n", "Dark ice then spreads from Lissandra's target dealing magic damage to all enemies in the area as it expands. The ice lasts for 3 seconds and slows enemy Movement Speed.\n", "Additional Information:\n", "\n", "\n\t", "\n\tYou can find discussions about everything related to this wiki on "]},
{"url": "http://leagueoflegends.wikia.com/wiki/Malphite", "urldoc": ["Malphite", "Shard of the Monolith", " ", " ", " or ", " ", " ", " ", "Release date", "Malphite's skin produces a layer of rock as a shield which absorbs damage equal to ", ". The shield will refresh if Malphite has not received damage in the last 10 seconds.\n", "\n", " Malphite sends a shard of the earth through the ground at his target, dealing magic damage upon impact and slowing them for 4 seconds.\n", "\n", "Additionally, Malphite will increase his own movement speed for 4 seconds by the same amount of flat movement speed that the target lost.\n", "Additional Information:\n", "\n", " Malphite's basic attacks deal a percentage of his attack damage to enemies within 200 range of the target.\n", " For 6 seconds, Malphite increases his armor and attack damage by a percentage.\n", "Additional Information:\n", "\n", " Malphite slams the ground, dealing magic damage to enemies within range and reducing their attack speed for 3 seconds.\n", "\n", " Malphite charges to the target location, and on arrival deals magic damage to enemies within 300 range and knocks them into the air for 1.", " seconds. Malphite cannot be interrupted during his charge by anything except his own death.\n", "Additional Information:\n", "\n", "\n\t", "\n\tYou can find discussions about everything related to this wiki on "]},
{"url": "http://leagueoflegends.wikia.com/wiki/Lux", "urldoc": ["Lux", "the Lady of Luminosity", " ", " ", " or ", " ", " ", " ", "Release date", "Lux's damaging spells mark any enemies with light energy for 6 seconds. Her autoattacks or ", " will consume the mark, dealing 10 + (10 × level) magic damage to the target.\n", "Additional Information:\n", "\n", " Lux releases a sphere of light in a line, striking up to two enemy units along its path. It deals magic damage to the first enemy it touches and half that damage to a second enemy behind it. Additionally, the first enemy struck is rooted for 2 seconds, and the second enemy is rooted for 1 second.\n", "Additional Information:\n", "\n", " Lux shields herself for up to 3 seconds and throws out her wand in a line, applying the same shield to allied champions in its path. Her wand then returns to her, again shielding allied champions in its path and Lux herself upon return. When reapplied, the shield does not stack, but is refreshed.\n", "Additional Information:\n", "\n", " Lux sends an anomaly of twisted light to a target area, slowing enemies within 300 range and granting sight of a slightly larger area for up to 5 seconds. At the end of the duration or if ", " is activated again, the zone will detonate and deal magic damage to enemies in the area.\n", "Additional Information:\n", "\n", " After gathering energy for half a second, Lux fires a broad and long-range beam of light in a line that deals magic damage to all enemies in the area.\n", "Any enemies that are already marked by ", " have it ignited for additional magic damage, then re-applied.\n", "Additional Information:\n", "\n", "\n\t", "\n\tYou can find discussions about everything related to this wiki on "]},
{"url": "http://leagueoflegends.wikia.com/wiki/Katarina", "urldoc": ["Katarina", "the Sinister Blade", " ", " ", " or ", " ", " ", " ", "Release date", "Scoring a kill or assist will reduce all the cooldowns of Katarina's abilities by 15 seconds.\n", "Additional Information:\n", "\n", " Katarina throws a dagger that bounces quickly from enemy to enemy, dealing magic damage and marking each enemy hit for 4 seconds. ", " hits a total of 5 unique targets (4 bounces), each striking the closest next target. Each subsequent hit deals 10% less damage.\n", "Striking a marked target with an ability or basic attack will consume the mark to deal additional magic damage.\n", "Additional Information:\n", "\n", " Katarina whirls her daggers, instantly dealing magic damage to all nearby enemies. If she damages an enemy champion, she gains movement speed for 1 second.\n", "Additional Information:\n", "\n", " Katarina teleports to target unit and gains 15% damage reduction for 1.", " seconds. If the target is an enemy, the target takes magic damage.\n", "Additional Information:\n", "\n", " Katarina rapidly spins in place and channels for 2.", " seconds, throwing a barrage of up to 30 daggers at the closest 3 enemy champions within range. Each dagger deals magic damage and applies Grievous Wounds for 3 seconds, reducing regeneration or incoming healing by 50%.\n", " can hit a single enemy champion no more than 10 times.\n", "Additional Information:\n", "\n", "\n\t", "\n\tYou can find discussions about everything related to this wiki on "]},
{"url": "http://leagueoflegends.wikia.com/wiki/Maokai", "urldoc": ["Maokai", "the Twisted Treant", " ", " ", " or ", " ", " ", " ", "Release date", "  Each time a champion's ability is used near Maokai, he gains a charge of Sap Magic. When he has 5 charges, his next basic attack will heal him for ", ".\n", "Additional Information:\n", "\n", " Maokai smashes the ground and sends an arcane shockwave forward, dealing magic damage and slowing enemies hit for 2 seconds. Enemies within 100 range of Maokai are also briefly knocked back.\n", "\n", " Maokai transforms into a cloud of arcane energy, becoming untargetable while quickly travelling to a target enemy. Once Maokai reaches the target, the target takes magic damage and is rooted for a short time.\n", "Additional Information:\n", "\n", " Maokai hurls a sapling to a target area, dealing magic damage on impact within 175 range. The sapling becomes implanted in the ground, granting 350 range vision of its surroundings for up to 35 seconds.\n", "After a 1 second delay after landing, the sapling will seek out nearby enemies. When an enemy comes within 250 range, the sapling will chase for up to 2.", " seconds and explode in an arcane blast that deals magic damage to enemies within 175 range.\n", "Additional Information:\n", "\n", " Maokai creates a great vortex of natural energy in a 575 radius area, reducing non-tower damage done to allied champions in the area by 20%. Maokai can prolong the effect as long as he has mana to spend on it.\n", "When the effect ends the energy is released, dealing magic damage to enemies within the vortex, plus bonus magic damage based off the damage stored by the damage reduction effect.\n", "Additional Information:\n", "\n", "\n\t", "\n\tYou can find discussions about everything related to this wiki on "]},
{"url": "http://leagueoflegends.wikia.com/wiki/Miss_Fortune", "urldoc": ["Miss Fortune", "the Bounty Hunter", " ", " ", " or ", " ", " ", "Release date", " Miss Fortune gains 25 movement speed after not taking damage for 5 seconds, which gradually increases to 70 movement speed over 5 seconds.\n", "\n", " Miss Fortune fires a shot at an enemy, dealing physical damage and 120% of that damage to another enemy behind it within 500 range. Both shots apply on-hit effects.\n", "Additional Information:\n", "\n", " Miss Fortune's autoattacks deal bonus magic damage. This damage stacks up to 5 times on the same target.\n", " Miss Fortune gains bonus attack speed for 6 seconds and her autoattacks also apply Grievous Wounds.\n", "Additional Information:\n", "\n", " Miss Fortune rains hundreds of bullets down onto target 100-radius area. This area lasts for 2 seconds, slowing and dealing magic damage every quarter of a second to enemies within.\n", "Additional Information:\n", "\n", " Miss Fortune channels for 2 seconds, spraying up to 8 waves of  bullets (6 bullets per wave) in a cone in front of her. A wave is fired every quarter of a second and deals physical damage to all enemies within the area.\n", "\n", "\n\t", "\n\tYou can find discussions about everything related to this wiki on "]},
{"url": "http://leagueoflegends.wikia.com/wiki/Master_Yi", "urldoc": ["Master Yi", "the Wuju Bladesman", " ", " ", " or ", " ", " ", " ", "Release date", "Every 4th consecutive autoattack, Master Yi strikes twice. The second attack uses an attack damage modifier of 50%, but applies on-hit effects fully and can critically strike.\n", " counter resets if Master Yi has not autoattacked in the last 4 seconds.\n", "Additional Information:\n", "\n", " Master Yi becomes untargetable and leaps to strike up to 4 enemies, dealing physical damage to each and dealing additional damage to minions and monsters.\n", "Each bounce will target the nearest enemy that has not yet been damaged. Master Yi re-appears at the initial target's location after the effect ends.\n", " can critically strike, dealing additional physical damage equal to ", ". Basic attacks reduce the cooldown of ", " by 1 second.\n", "Additional Information:\n", "\n", " Master Yi channels for up to 4 seconds, restoring health each second. This healing is increased by 1% for every 1% of his missing health.\n", "While channeling, Master Yi reduces incoming damage. This damage reduction is halved against turrets.\n", "Additional Information:\n", "\n", " Master Yi gains ", " as bonus attack damage.\n", "\n", " Autoattacks deal bonus true damage for 5 seconds. Afterwards, the passive bonus is lost until ", " is off cooldown.\n", "Additional Information:\n", "\n", " Champion kills and assists reduce the remaining cooldown of Master Yi's other abilities by 70%.\n", " For 10 seconds, Master Yi gains increased movement speed and attack speed, and becomes immune to slows. While active, champion kills and assists extend the duration of ", " by 4 seconds.\n", "Additional Information:\n", "\n"]},
{"url": "http://leagueoflegends.wikia.com/wiki/Mordekaiser", "urldoc": ["Mordekaiser", "the Master of Metal", " ", " ", " or ", " ", " ", " ", "Release date", "35% of the damage dealt from abilities is converted into a temporary absorption shield. Shield generation is only half as effective against minions and monsters. Maximum shield strength is 90 + (30 × (level)). The shield decays by 3% per second.\n", "Additional Information:\n", "\n", " Mordekaiser enhances his next attack, converting it to deal magic damage and replacing the base attack damage component with a base amount of damage. He swings his mace with such force that it echoes out, striking up to 3 additional nearby targets.\n", "If the target is alone, the ability deals 65% more damage.\n", "Additional Information:\n", "\n", " Mordekaiser creates a protective cloud of metal shards to surround an ally unit or himself for 6 seconds, increasing the target's armor and magic resistance and damaging enemies within 250 range.\n", "Additional Information:\n", "\n", " Mordekaiser afflicts all enemies in a cone in front of him, dealing magic damage.\n", "\n", " Mordekaiser deals magic damage to a target enemy champion and curses it for 10 seconds, dealing additional magic damage over time and healing himself for the damage done.\n", "If the target dies while under the effect of the curse, their soul is enslaved as a controllable ghost and will follow Mordekaiser for 30 seconds. The Ghost cannot use any active skills or items and deals magic damage with its basic attacks.\n", "The Ghost's stats are:\n", "During this time, Mordekaiser gains 20% of the enslaved champion's total AP and AD. This bonus does not affect the ghost's stats.\n", "Additional Information:\n", "\n", "\n\t", "\n\tYou can find discussions about everything related to this wiki on "]},
{"url": "http://leagueoflegends.wikia.com/wiki/Nasus", "urldoc": ["Nasus", "the Curator of the Sands", " ", " ", " or ", " ", " ", " ", "Release date", "Nasus drains his foe's spiritual energy, giving him a natural ", " / ", " / ", "% life steal.\n", " Nasus' next attack within the next 10 seconds will deal bonus physical damage.\n", "If the attack kills its target, Nasus gains 3 stacks of Siphoning Strike. The number of stacks gained is doubled for killing champions, large minions and large monsters. Siphoning Strike's bonus damage is increased by an amount equal to his current stacks.\n", "Additional Information:\n", "\n", " Nasus ages his target, slowing their movement speed by 35% for 5 seconds. The slow increases over the duration. The target's attack speed is also slowed by half the amount, initially slowed by 17.", "% and increasing over the duration.\n", "If the duration of Wither is reduced by crowd control reduction, the increasing slow is applied faster so that it reaches the same max amount at the end.\n", "\n", " Nasus unleashes a spirit flame at a target 400-radius area, dealing magic damage to enemies caught within. The spirit flame burns for 5 seconds afterwards, dealing magic damage each second and reducing the armor of enemies within the area.\n", "Additional Information:\n", "\n", " Nasus summons a sandstorm to empower himself for 15 seconds, enlarging his size, gaining bonus health and increasing his attack range by 50.\n", "While the storm rages, enemies within 175 range take magic damage equal to a percentage of their maximum health (max of 240 magic damage per second per enemy). Nasus converts 6.", "% of the damage done by the sandstorm into bonus attack damage for himself. The maximum bonus attack damage that can be gained is 300.\n", "Additional Information:\n", "\n", "\n\t", "\n\tYou can find discussions about everything related to this wiki on "]},
{"url": "http://leagueoflegends.wikia.com/wiki/Malzahar", "urldoc": ["Malzahar", "the Prophet of the Void", " ", " ", " or ", " ", " ", " ", "Release date", " On every fourth ability use, Malzahar summons a voidling for 21 seconds.\n", "A voidling has 200 + (50 × level) health and 20 + (5 × level) ", " attack damage. After 7 seconds, the voidling grows, gaining 50% increased armor and attack damage. After 14 seconds, the voidling gains attack speed.\n", "Voidlings prioritize their attacks on the target of Nether Grasp, then enemies suffering from the most recent Malefic Visions, then the target Malzahar is attacking.\n", "Additional Information:\n", "\n", "\n", " Malzahar opens up two portals to the Void ", " range from each other. After a short delay, power erupts from them, damaging and silencing all enemies caught between the portals.\n", "Additional Information:\n", "\n", "\n", " Malzahar creates a 250-radius zone of negative energy for 5 seconds. Enemies that stand in the zone take magic damage every second equal to a percentage of their max health. Damage to monsters and minions are capped at 120.\n", "Additional Information:\n", "\n", "\n", " Infects target enemy's mind, dealing magic damage over 4 seconds. If the target dies during this time, the target passes Malefic Visions to the closest enemy, refreshing the duration and restoring mana to Malzahar.\n", "Additional Information:\n", "\n", "\n", " Malzahar channels an engulfing void of energy for up to 2.5 seconds, suppressing and dealing magic damage to a target enemy champion while the channel holds.\n", "Additional Information:\n", "\n", "\n", "\n", "\n\t", "\n\tYou can find discussions about everything related to this wiki on "]},
{"url": "http://leagueoflegends.wikia.com/wiki/Morgana", "urldoc": ["Morgana", "Fallen Angel", " ", " ", " or ", " ", " ", " ", "Release date", "Morgana is granted ", " / ", " / ", " bonus spell vamp.\n", "Additional Information:\n", "\n", " Morgana releases a sphere of dark magic that travels in a line, dealing magic damage and rooting the first enemy unit it hits for a short time.\n", "\n", " Morgana infects target 175-radius area for 5 seconds, causing enemy units who stand on the location to take magic damage every half second. The damage is increased by 0.", "% for every 1% of the target's missing health.\n", "Additional Information:\n", "\n", " Places a shield around target friendly champion for up to 5 seconds, absorbing magic damage and preventing disables while the shield holds.\n", "Additional Information:\n", "\n", " Morgana latches chains of energy onto nearby enemy champions for 3 seconds, dealing initial magic damage to them after a brief delay of 0.", " seconds and reducing their movement speed by 20% if the target(s) stay within 1050 range.\n", "If the target(s) does not break the tether after 3 seconds, they are dealt the same amount of magic damage again and they are also stunned for 1.", " seconds.\n", "Additional Information:\n", "\n", "\n\t", "\n\tYou can find discussions about everything related to this wiki on "]},
{"url": "http://leagueoflegends.wikia.com/wiki/Nautilus", "urldoc": ["Nautilus", "the Titan of the Depths", " ", " ", " or ", " ", " ", " ", "Release date", "Nautilus's basic attacks deal an additional 2 + (6 × level) physical damage and root his target for ", " / ", " / ", " / ", " / ", " seconds.\nThis effect cannot trigger on the same target more than once every 12 seconds.\n", "\n", " Nautilus hurls his anchor forward in a line. If it hits an enemy unit, Nautilus drags himself and the unit together, dealing magic damage and briefly stunning the enemy. If the anchor hits terrain, Nautilus will drag himself forward and the cooldown is reduced by 50%.\n", "Additional Information:\n", "\n", " Nautilus gains a shield that absorbs a certain amount of damage. The shield dissipates after 10 seconds if not already destroyed. While the shield persists, Nautilus's basic attacks are enhanced to debuff all enemies within 175 range of his target, dealing bonus magic damage over 2 seconds. Titan's Wrath also resets Nautilus' basic attack timer when first used.\n", "Additional Information:\n", "\n", " Nautilus slams the ground, causing the earth to explode around him in 3 waves. Each explosion deals magic damage to enemies in the area and slows them for 2 seconds. This slow diminishes over time.\n", "An enemy can be hit by more than one explosion, but take 50% reduced damage after the first.\n", "Additional Information:\n", "\n", " Nautilus fires a shockwave that chases a target enemy champion, dealing magic damage and knocking up enemies it passes through.\n", "The shockwave explodes upon hitting its target, dealing magic damage, knocking them up for 1 second and stunning the target.\n", "Additional Information:\n", "\n", "\n\t", "\n\tYou can find discussions about everything related to this wiki on "]},
{"url": "http://leagueoflegends.wikia.com/wiki/Lulu", "urldoc": ["Lulu", "the Fae Sorceress", " ", " ", " or ", " ", " ", " ", "Release date", "Whenever Lulu or the allied target of ", " attacks an enemy (excluding structures and wards), Pix fires a barrage of 3 homing bolts toward the same target that deal ", " / ", " / ", " / ", " / ", " / ", " / ", " / ", " / ", " ", " magic damage each to the first enemy they each hit.\n", "Additional Information:\n", "\n", "\n", " Lulu and Pix each fire a magic bolt towards a target direction, dealing magic damage and slowing enemies hit by 80% for a short time. This slow decreases to 0% ", " over its duration. An enemy can only be affected by one bolt.\n", "Additional Information:\n", "\n", "\n", " Target allied champion gains 30% ", " movement speed for 5 seconds.\n", " Polymorphs an enemy champion for a short duration, disabling their ability to attack or cast abilities and reducing their base movement speed by 60.\n", "Additional Information:\n", "\n", "\n", " Commands Pix to jump to an ally and grant them a shield for up to 6 seconds. Additionally, Pix will then follow the ally and aid their attacks instead of Lulu's for 6 seconds.\n", " Pix deals magic damage to target enemy unit. Pix then follows and grants vision of them for 6 seconds.\n", "Additional Information:\n", "\n", "\n", " Lulu enlarges a target allied champion, knocking up enemies within 150 range of the target. For 7 seconds, her ally gains bonus health and an aura that continually slows nearby enemies.\n", "Additional Information:\n", "\n", "\n", "\n", "\n\t", "\n\tYou can find discussions about everything related to this wiki on "]},
{"url": "http://leagueoflegends.wikia.com/wiki/Nami", "urldoc": ["Nami", "the Tidecaller", " ", " ", " or ", " ", " ", " ", "Release date", "When Nami's abilities hit allied champions they gain 40 ", " movement speed for 1.", " seconds.\n", " Nami sends a bubble into the air towards a targeted area. When it lands, it deals magic damage to all enemies in the area of impact and suspends them for 1.", " seconds.\n", "\n", " Nami unleashes a stream of water that bounces between allied and enemy champions. This ability can only bounce to each target once and hits up to 3 targets. The damage is modified by –15% + ", " with each bounce.\n", "On ally hits, ", " heals the target and bounces towards a nearby enemy champion. On enemy hits, the torrent deals magic damage and bounces towards a nearby allied champion.\n", "Additional Information:\n", "\n", " Empowers an allied champion for 6 seconds or until they have attacked 3 times. During this time, their basic attacks deal bonus magic damage and slow the target hit for 1 second.\n", "Additional Information:\n", "\n", " Summons a tidal wave that moves outward in a broad line and deals magic damage to enemies it comes into contact with, briefly knocking them up and then slowing them. The slow duration increases based on how far the tidal wave has traveled, with a minimum duration of 2 seconds and a maximum duration of 4 seconds.\n", "Additional Information:\n", "\n"]},
{"url": "http://leagueoflegends.wikia.com/wiki/Nunu", "urldoc": ["Nunu", "the Yeti Rider", " ", " ", " or ", " ", " ", " ", "Release date", "After 5 autoattacks, Nunu's next spell will have no mana cost.\n", "  Nunu commands his yeti to take a bite out of target enemy minion or neutral monster, dealing true damage to it and restoring Nunu's health. Nunu gains a bonus depending on what Willump consumed. Consume does not need to score the killing blow to trigger the bonuses and the individual bonuses stack.\n", "Additional Information:\n", "\n", " Invigorates an allied unit by heating their blood, increasing their attack speed and movement speed for 12 seconds. If cast on an ally, Nunu also gains the effect of Blood Boil.\n", "Additional Information:\n", "\n", " Nunu throws a ball of ice at an enemy unit, dealing magic damage and slowing their movement speed by a percentage and attack speed by 25% for 3 seconds.\n", "\n", " Nunu starts channeling and begins to sap a large area around him of heat, slowing all nearby enemies movement speed by 50% and attack speed by 25%.\n", "After channeling for 3 seconds, he deals massive damage to all enemies caught in the area. If the channel is cancelled or interrupted early, it will deal between 12.", "% and 87.", "% damage, depending on how long it was channeled before being cancelled.\n", "Additional Information:\n", "\n", "\n\t", "\n\tYou can find discussions about everything related to this wiki on "]},
{"url": "http://leagueoflegends.wikia.com/wiki/Nocturne", "urldoc": ["Nocturne", "the Eternal Nightmare", " ", " ", " or ", " ", " ", " ", "Release date", "Nocturne's attacks are periodically enhanced, damaging surrounding enemies for ", " and healing himself for ", " / ", " / ", " per enemy hit. Cooldown reduction does not affect Umbra Blades, but every basic attack reduces the cooldown by 1 second.\n", "Additional Information:\n", "\n", " Nocturne sends out a shadow blade in a line that leaves a Dusk Trail on its path, dealing physical damage to enemies it passes through and causing enemy champions hit to also leave a Dusk Trail behind their movements for 5 seconds. While on the Dusk Trail, Nocturne ignores unit collision and gains bonus movement speed and attack damage.\n", "Additional Information:\n", "\n", " Nocturne empowers his blades, permanently gaining attack speed.\n", " Nocturne creates a barrier that blocks the next enemy spell that hits him within the next 1.", " seconds. If Nocturne blocks a spell, the passive attack speed bonus is doubled for 5 seconds.\n", "Additional Information:\n", "\n", " Nocturne plants nightmares into his target's mind, dealing magic damage over 2 seconds. If Nocturne remains within 465 range of the target for the full duration, it turns and flees for a short duration.\n", "Additional Information:\n", "\n", " Nocturne reduces the sight radius of all enemy champions and removes their shared vision for 4 seconds; this includes champions, minions, wards, towers, and ", ".\n", "While ", " is active, Nocturne can activate it again to launch himself at a target enemy champion within range, dealing physical damage.\n", "Additional Information:\n", "\n", "\n\t", "\n\tYou can find discussions about everything related to this wiki on "]},
{"url": "http://leagueoflegends.wikia.com/wiki/Nidalee", "urldoc": ["Nidalee", "the Bestial Huntress", " ", " ", " or ", " ", " ", " ", "Release date", "Moving through ", " increases Nidalee's movement speed by 15%. The buff lasts for an additional 2 seconds after leaving brush.\n", "Additional Information:\n", "\n", " Nidalee hurls her javelin forward in a line, dealing magic damage to the first enemy it hits. After having traveled 525 units, the javelin's damage will start rapidly increasing. The damage modifier is capped at 250% at maximum range. \n", " Nidalee's next attack will be enhanced to deal additional physical damage. The bonus damage and the attack's own damage are both increased by 2% for every 1% of the target's missing health.\n", "\n", "Additional Information:\n", "\n", " Nidalee lays a trap at a target location. When sprung by an enemy unit the trap deals magic damage to it over 2 seconds, revealing them and reducing their armor and magic resistance for 8 seconds. Traps last for 4 minutes.\n", " Nidalee lunges forward a short distance, dealing magic damage to enemies within a radius of ", " around her landing point.\n", "\n", "Additional Information:\n", "\n", " Nidalee evokes the spirit of the cougar, healing a target allied champion or herself and granting them bonus attack speed for 7 seconds.\n", " Nidalee claws at enemies in a cone in front of her, dealing magic damage.\n", "\n", "Additional Information:\n", "\n", " Nidalee transforms herself into a cougar, gaining a new set of abilities and 20 movement speed. Nidalee loses 400 range while using this ability (effective range of 125).\n", "Each rank in Aspect of the Cougar increases the ranks of all of Nidalee's cougar abilities.\n", "Additional Information:\n", "\n", "\n\t", "\n\tYou can find discussions about everything related to this wiki on "]},
{"url": "http://leagueoflegends.wikia.com/wiki/Pantheon", "urldoc": ["Pantheon", "the Artisan of War", " ", " ", " or ", " ", " ", " ", "Release date", " After ", " or using an ", " 4 times, Pantheon will block the next incoming basic attack or ", " attack that would deal more than 40 ", " to him.\n", "Additional Information:\n", "\n", " Pantheon hurls his spear at an enemy unit, dealing physical damage.\n", "Additional Information:\n", "\n", " Pantheon leaps at an enemy and bashes them with his shield, dealing ", " and ", " them for 1 second. Pantheon's Aegis Protection is also refreshed.\n", "Additional Information:\n", "\n", " Pantheon's basic attacks and ", " gain 100% critical strike chance against targets below 15% health.\n", "\n", " Pantheon ", " for 0.", " seconds, dealing 3 swift strikes in a cone in front of him over the duration. Each strike deals physical damage, and they deal double damage to champions.\n", "Additional Information:\n", "\n", " Pantheon gathers his strength, channels for 2 seconds and then leaps high into the air, crashing down at the target location 1.", " seconds later. Enemies within 700 range of Pantheon's impact are slowed by 35% for 1 second and take magic damage that decreases the further the target is from the impact point, with a minimum of 50% damage. If the channeling is cancelled, the cooldown is reduced to 10 seconds.\n", "Additional Information:\n", "\n"]},
{"url": "http://leagueoflegends.wikia.com/wiki/Orianna", "urldoc": ["Orianna", "the Lady of Clockwork", " ", " ", " or ", " ", " ", " ", "Release date", "Orianna’s autoattacks deal ", " / ", " / ", " / ", " / ", " / ", " ", " bonus magic damage on hit. Subsequent attacks on the same target within 4 seconds deal an additional 20% magic damage. This bonus stacks up to 2 times, dealing a maximum of ", " / ", " / ", " / ", " / ", " / ", " ", " magic damage.\n", "Additional Information:\n", "\n", " Orianna commands the Ball to fly towards the target location, dealing magic damage to all enemies that the Ball passes through or that are in the target area. However, the Ball deals 10% less damage for each subsequent target hit down to a minimum of 40% damage done. After ", " is used, the Ball remains behind at the target location.\n", "Additional Information:\n", "\n", " Orianna commands the Ball to emit an electric pulse around its current location, dealing magic damage to enemies within 250 range and leaving an electric field on the area for 3 seconds that speeds up allies and slows enemies that walk over it. This effect diminishes to normal over 2 seconds after leaving the area.\n", "Additional Information:\n", "\n", " The allied champion the Ball is currently attached to is granted bonus armor and magic resistance.\n", " Orianna commands the Ball to fly to and attach onto an allied champion, dealing damage to enemies it passes through and shielding the allied champion for 4 seconds when it arrives.\n", "Additional Information:\n", "\n", " Orianna commands the Ball to unleash a shockwave after 0.", " seconds, dealing magic damage to enemies within 400 range and flinging them into the air 350 range towards, and possibly over, the Ball.\n", "Additional Information:\n", "\n", "Orianna is accompanied by the Ball, which is the focus of her abilities. It attaches itself to Orianna if she walks near it and also blinks back to Orianna if she is too far away. The Ball has a leash range of 1125.\n", "Whenever Orianna does not have the Ball attached to her, an arrow will appear near her, pointing toward the Ball's location. This arrow changes color depending on Orianna's distance from the Ball.\n", "Using any ability sets off a 0.", " second global cooldown.\n", "\n", "\n\t", "\n\tYou can find discussions about everything related to this wiki on "]},
{"url": "http://leagueoflegends.wikia.com/wiki/Rammus", "urldoc": ["Rammus", "the Armordillo", " ", " ", " or ", " ", " ", " ", "Release date", "Rammus receives bonus attack damage equal to ", ".\n", "Additional Information:\n", "\n", " Rammus enters a rolling ball state for up to 7 seconds, constantly accelerating from an initial bonus 3% move speed up to a bonus 165% move speed. While in this state, Rammus cannot attack or use ", ". Activating ", " or re-activating Powerball during its duration will end the effect instantly.\n", "Upon colliding with an enemy unit, all nearby enemies are briefly knocked back, take magic damage, and are slowed for 3 seconds afterwards. Rammus reverts to his normal state as well.\n", "Additional Information:\n", "\n", " Rammus enters a defensive stance for 6 seconds, increasing his armor and magic resistance and dealing magic damage to enemies whenever they use a basic attack against him.\n", "Defensive Ball Curl will end if ", " is activated during its duration.\n", "Additional Information:\n", "\n", " Rammus taunts an enemy champion or monster, reducing their armor and forcing them to attack Rammus for a few seconds.\n", "\n", " Rammus creates an earthquake around himself for 8 seconds, dealing magic damage to units and structures within 300 range each second. Tremors does not hinder Rammus' actions.\n", "Additional Information:\n", "\n", "\n", "\n\t", "\n\tYou can find discussions about everything related to this wiki on "]},
{"url": "http://leagueoflegends.wikia.com/wiki/Renekton", "urldoc": ["Renekton", "the Butcher of the Sands", " ", " ", " or ", " ", " ", " ", "Release date", "Renekton's abilities have no cost related to them and their use is limited only by cooldowns. Instead, he uses Fury as his secondary resource. Renekton starts with 0 Fury and it is capped at 100. Renekton gains 5 Fury with each auto-attack, and with the use of some of his abilities. When Renekton has 50 or more Fury, his next ability will consume 50 Fury for an enhanced effect. Fury will decay at a rate of 5 per 2 seconds if Renekton has not dealt or received damage in the last 12 seconds. \n", "Renekton gains 50% more Fury from all sources while below half health.\n", "Additional Information:\n", "\n", " Renekton deals physical damage to all enemies within range, gaining 5 Fury for each target hit and healing for some of the damage dealt, up to a cap. Renekton heals for 20% of the damage dealt to champions and 5% of the damage dealt to minions and monsters.\n", " Cull the Meek deals 50% additional damage. The heal is doubled to 40% against champions and 10% against minions and monsters, and the healing cap is tripled.\n", "Additional Information:\n", "\n", " Renekton’s next basic attack will hit twice, stunning his target for 0.", " seconds and dealing physical damage equal to a base amount plus a percentage of his attack damage. Each hit applies on-hit effects and grants Fury.\n", " Ruthless Predator will strike his opponent 3 times, dealing 50% additional damage and increasing the stun duration to 1.", " seconds. Each hit still applies on-hit effects, but does not grant Fury.\n", "Additional Information:\n", "\n", " Renekton dashes forward, dealing physical damage to enemies he hits along the way. If he hits a target he gains the ability to use Dice for 4 seconds.\n", " Renekton dashes forward, dealing physical damage to enemies he hits along the way.\n", " Dice deals 50% additional damage and shreds the armor of targets hit for 4 seconds.\n", "\n", " Renekton empowers himself with dark energies for 15 seconds, enlarging his size and gaining bonus health. While in this state, he deals magic damage each second to enemies within 175 range and generates 5 Fury per second.\n", "Additional Information:\n", "\n", "\n\t", "\n\tYou can find discussions about everything related to this wiki on "]},
{"url": "http://leagueoflegends.wikia.com/wiki/Poppy", "urldoc": ["Poppy", "the Iron Ambassador", " ", " ", " or ", " ", " ", " ", "Release date", "Whenever Poppy would otherwise suffer damage greater than 10% of her current health all damage exceeding that threshold is halved; Poppy receives the first 10% normally. ", " has no internal cooldown and is not affected by structures.\n", "Additional Information:\n", "\n", " Poppy's next basic attack is converted to deal magic damage and deals bonus damage equal to a flat amount plus 8% of the target's maximum health. ", " percent health component cannot exceed a damage threshold.\n", "Additional Information:\n", "\n", " Taking damage or attacking an enemy increases Poppy's armor and attack damage for 5 seconds, stacking up to 10 times.\n", " Poppy receives maximum stacks of ", ". Additionally, she gains increased movement speed for 5 seconds.\n", "Additional Information:\n", "\n", " Poppy charges at an enemy in a line, dealing magic damage and carrying them along her path. If they collide with terrain, she stuns her target for 1.", " seconds, dealing additional magic damage.\n", "Additional Information:\n", "\n", " Poppy focuses intensely on a single enemy champion, dealing amplified damage to them, and becoming immune to all damage and abilities that are not from the marked champion.\n", "Additional Information:\n", "\n"]},
{"url": "http://leagueoflegends.wikia.com/wiki/Quinn", "urldoc": ["Quinn", "Demacia's Wings", " ", " ", " or ", " ", " ", " ", "Release date", "Valor periodically marks a nearby enemy with Vulnerability for 4.", " seconds. If Quinn attacks a Vulnerable enemy, she deals ", " / ", " / ", " / ", " / ", " / ", " / ", " / ", " / ", " / ", " / ", " / ", " / ", " / ", " / ", " / ", " / ", " / ", " ", " bonus physical damage. This cannot occur again for 10 seconds, or 3 seconds if Quinn triggers the vulnerability. Valor will first prioritize Quinn's most recent attack target. If Quinn has not attacked anyone recently, Valor will target nearby low health units (prioritizing champions over minions).\n", "Harrier is disabled while Tag Team is active.\n", "Additional Information:\n", "\n", " Quinn commands Valor to fly forwards in a line, stopping when he collides with an enemy. Valor then deals physical damage and blinds nearby enemies within 210 range for 1.", " seconds.\n", " Valor deals physical damage to all enemies within 275 range of himself and blinds them for 1.", " seconds.\n", "\n", " Attacking a Vulnerable target will grant Quinn bonus attack speed and flat movement speed for 3 seconds.\n", " Valor gains bonus attack speed.\n", "\n", " All area within range is revealed for 2 seconds.\n", "\n", " Quinn dashes to an enemy, knocking it back a short distance, dealing physical damage and slowing the target's movement speed by 50%. This slow decays over 2 seconds.\n", "Upon reaching the target, she leaps off and lands near her maximum attack range away from the target. Valor will immediately mark this target as Vulnerable.\n", " Valor dashes to an enemy and applies the same slow, knockback and physical damage, but does not mark or leap off the target.\n", "Additional Information:\n", "\n", " For 20 seconds, Valor replaces Quinn on the battlefield as a mobile melee attacker with alternate versions of Quinn's abilities. Valor can move through units and gains greatly increased movement speed that gradually decreases to a lower amount while in combat.\n", " Quinn returns to perform Skystrike, dealing physical damage to all enemies within range. The damage increases by 1% for every 1% of an enemy's missing health.\n", "If Skystrike has not been cast during Tag Team, it will be cast automatically when Tag Team ends.\n", "Additional Information:\n", "\n"]},
{"url": "http://leagueoflegends.wikia.com/wiki/Rengar", "urldoc": ["Rengar", "the Pridestalker", " ", " ", " or ", " ", " ", " ", "Release date", "Rengar's abilities have no cost related to them and their use is limited only by cooldowns. Instead, he uses his secondary resource bar to display his unique mechanic: Ferocity. \n", "Rengar builds 1 point of Ferocity whenever he lands an ability. Upon reaching 5 Ferocity, Rengar gains the ability to cast an alternate set of abilities, which are empowered versions of his basic abilities. The two ability-sets do not share cooldowns, and his basic abilities' cooldowns will continue to count down while his empowered abilities are available. His empowered abilities have no cooldown and can be used whenever 5 Ferocity is available, though using an empowered ability consumes all 5 Ferocity. \n", "While in brush or in stealth, Rengar gains bonus attack range and his attacks cause him to leap at his target. This bonus lasts for ~0.5 second upon exiting brush or stealth. This will happen regardless of whether or not his target has sight of him, and has no internal cooldown.\n", " Rengar's next basic attack in the next 2 seconds deals bonus physical damage and grants him increased attack speed for 4 seconds.\n", " Savagery deals additional damage equal to 100% of Rengar's attack damage, and he gains increased attack speed equal to double the normal bonus. Basic and Empowered Savagery's attack speed bonuses can overlap and stack with each other.\n", " Rengar lets out a battle roar, dealing magic damage to nearby enemies. If an enemy is hit by Battle Roar, Rengar also gains bonus armor and magic resist for 3 seconds.\n", " Battle Roar also heals Rengar for 20 + (10 × level) health, increased by 1% for every 1% of Rengar's missing health, regardless of whether the ability hits an enemy or not. Basic and Empowered Battle Roar's defense bonuses do not stack with each other.\n", " Rengar throws a bola at his target, dealing physical damage and slowing it for 2.5 seconds. The slow decays over the duration.\n", " Bola Strike initially roots his target for 1 second. The slow is then applied in full after the 1 second, and decays over the remaining 1.", " seconds.\n", " Rengar activates his predatory instincts, stealthing himself after 1 second (delayed up to 3 seconds if taking damage) and revealing all enemy Champions in a large radius around him. He gains movement speed and generates 1 Ferocity per 0.", " second while stealthed. Lasts 7 seconds or until Rengar uses an ability.\n", "If Rengar has a ", " with 14 trophies, the duration is increased to 10 seconds. Additionally, Rengar's next ability used after activating Thrill of the Hunt generates 1 bonus Ferocity.\n", "Rengar has access to a unique item:\n", " 5 ", ", 2 attack damage per level", "\n", " Kills and assists grant 1 Trophy. Deaths consume 1 Trophy. \n", "Scoring a kill or assist on ", " during the ", ", ", ", causes this item to upgrade into the ", ", which permanently grants the effects of all 14 trophies.\n", "\n", "\n\t", "\n\tYou can find discussions about everything related to this wiki on "]},
{"url": "http://leagueoflegends.wikia.com/wiki/Ryze", "urldoc": ["Ryze", "the Rogue Mage", " ", " ", " or ", " ", " ", " ", "Release date", "When Ryze casts a spell, all of his other spells have their cooldown reduced by 1 second.\n", "Additional Information:\n", "\n", " Ryze gains cooldown reduction.\n", " Ryze throws a charge of pure energy at an enemy unit, dealing magic damage.\n", "\n", " Ryze traps an enemy in a cage of magic, dealing magic damage and rooting it for a short time.\n", "\n", " Ryze unleashes an orb of magical power which bounces to enemy units or himself within 200 range, up to 5 times (for a total of 6 hits). \n", "Against enemies, each bounce deals magic damage and reduces magic resistance for 5 seconds. This reduction does not stack with multiple hits. The orb has no effect on Ryze if it bounces back to himself.\n", "Additional Information:\n", "\n", " Ryze becomes supercharged, gaining spell vamp and bonus flat movement speed, and causing his spells to deal 50% of their damage to other enemies in a 200 unit radius around the original target.\n", "Additional Information:\n", "\n", "\n\t", "\n\tYou can find discussions about everything related to this wiki on "]},
{"url": "http://leagueoflegends.wikia.com/wiki/Sejuani", "urldoc": ["Sejuani", "the Winter's Wrath", " ", " ", " or ", " ", " ", " ", "Release date", "Damaging an enemy with an ability or basic attack grants ", " / ", " / ", " / ", " bonus armor and reduces movement-slowing effects on Sejuani by ", " / ", " / ", " / ", "% for 2 seconds. Subsequent damage will increase the duration by 2 seconds up to a cap of 8 seconds, with further damage refreshing the duration.\n", "Additional Information:\n", "\n", " Sejuani charges forward, knocking enemies into the air and dealing magic damage equal to a flat amount plus a percentage of their maximum health (max 300 damage to monsters). This charge stops after knocking an enemy champion into the air.\n", "Additional Information:\n", "\n", " Sejuani's next basic attack deals bonus magic damage to the target and enemies near it. She then swings her flail, dealing magic damage each second to enemies within range for 4 seconds. If this ability is reactivated, Sejuani immediately starts swinging her flail.\n", "Additional Information:\n", "\n", " Sejuani's abilities and basic attacks apply Frost to enemies for 4 seconds.\n", " All nearby enemies with Frost take magic damage and are slowed, and the Frost debuff is removed from the targets of Permafrost. This spell is unable to be cast if no enemies in range have the Frost debuff.\n", "Additional Information:\n", "\n", " Sejuani throws her frost-forged bola in a line. If the bola hits an enemy champion, it shatters, stunning the target and nearby enemies for a duration. If the bola reaches its maximum range, it shatters and slows enemies by 90% instead for the same duration.\n", "All enemies in the shatter area take magic damage.\n", "Additional Information:\n", "\n", "\n\t", "\n\tYou can find discussions about everything related to this wiki on "]},
{"url": "http://leagueoflegends.wikia.com/wiki/Riven", "urldoc": ["Riven", "the Exile", " ", " ", " or ", " ", " ", " ", "Release date", "Riven's abilities charge her blade for 5 seconds, causing her to do ", " as bonus physical damage on her next basic attack. Riven can store up to 3 charges, and can only expend one at a time.\n", "Additional Information:\n", "\n", " Riven steps forward and lashes out in a series of powerful slashes that will deal physical damage to all enemies within 112.", " range. This ability can be activated a second time within 4 seconds, and a third time within 4 seconds of that. The third activation damages enemies within 150 range and also knocks them up. All three strikes deal the same damage.\n", "Additional Information:\n", "\n", " Riven deals physical damage to all enemies within range and stuns them for 0.", " seconds.\n", "\n", " Riven dashes towards the cursor and gains a shield that absorbs incoming damage for 1.", " seconds.\n", "Additional Information:\n", "\n", " For 15 seconds Riven's sword is reformed, granting her 20% increased attack damage and 75 increased range on her basic attacks. Also Broken Wings's normal and third area of effect radius increase to 162.", " and 200, and Ki Burst's area of effect radius increases to 135. She is also granted the ability to use Wind Slash once for the duration.\n", " Riven unleashes a 2200-speed wave of energy in a cone, dealing physical damage to all enemies hit. Damage is increased by 2.", "% for every 1% of an enemy's missing health, capping at 200% bonus damage (300% damage total) against enemies with 75% or more missing health.\n", "Additional Information:\n", "\n"]},
{"url": "http://leagueoflegends.wikia.com/wiki/Singed", "urldoc": ["Singed", "the Mad Chemist", " ", " ", " or ", " ", " ", " ", "Release date", "Singed gains additional health equal to ", ".\n", "Additional Information:\n", "\n", " Singed leaves a trail of poison behind him that lasts for 3.25 seconds. Enemies caught in the path will be dealt magic damage each second for 3 seconds. Continual exposure renews the poison.\n", "Additional Information:\n", "\n", " Singed creates a pool of mega adhesive on the ground in a target 175-radius area. The adhesive lasts 5 seconds, causing all enemies who touch it to be slowed as long as they are in the adhesive and for 1 second once they are out of it.\n", "Additional Information:\n", "\n", " Singed flings a target enemy unit, dealing magic damage and placing the unit behind himself.\n", "Additional Information:\n", "\n", " Singed drinks a potent brew of chemicals, enhancing his ability power, armor, magic resistance, movement speed, health and mana regeneration per 5 seconds. Lasts 25 seconds.\n", "Additional Information:\n", "\n", "\n", "\n\t", "\n\tYou can find discussions about everything related to this wiki on "]},
{"url": "http://leagueoflegends.wikia.com/wiki/Sion", "urldoc": ["Sion", "the Undead Champion", " ", " ", " or ", " ", " ", " ", "Release date", "Sion has a 40% chance to ignore up to ", " / ", " / ", " damage each time he is hit by a basic attack. The damage reduction is calculated before armor and percentage damage reduction benefits are taken into account.\n", "\n", " Sion's gaze terrifies a single enemy, dealing magic damage and stunning it for 1.5 seconds.\n", "\n", " Sion surrounds himself with a shield which absorbs damage for up to 10 seconds. After 4 seconds, if the shield has not been destroyed, the ability can be cast again to explode and deal magic damage to surrounding enemies. It will explode automatically after the 10 seconds have passed.\n", "Additional Information:\n", "\n", " While toggled on, Sion has increased attack damage at the cost of some health for each basic attack. While Enrage is active, Sion permanently increases his maximum health whenever he kills a unit with either his attacks or abilities. This effect is doubled against champions and large units.\n", "Additional Information:\n", "\n", " For 20 seconds, Sion gains bonus lifesteal and 50% attack speed. Additionally, Sion's basic attacks will heal surrounding allies for a percentage of the damage dealt.\n", "Additional Information:\n", "\n", "\n"]},
{"url": "http://leagueoflegends.wikia.com/wiki/Shaco", "urldoc": ["Shaco", "the Demon Jester", " ", " ", " or ", " ", " ", "Release date", "(+20% AP)", "Shaco deals 20% bonus damage when striking a unit from behind with his basic attacks or abilities.\n", "Additional Information:\n", "\n", " Shaco instantly blinks to a target nearby location and enters stealth for up to 3.5 seconds. Dealing damage will break stealth early. His next basic attack within 6 seconds is guaranteed to critically strike for modified base critical damage. Bonus critical damage from items, runes and mastery is applied for the full amount.\n", "Additional Information:\n", "\n", " Shaco summons a ", " at the target location that stealths after a 2 second delay and lasts for up to 60 seconds. When an enemy comes within 300 units, the box springs open: causing surrounding enemies to turn and flee while it attacks nearby enemies for up to 5 seconds.\n", "Additional Information:\n", "\n", " Shaco's basic attacks poison his targets, reducing their movement speed for 2 seconds. It also gives affected non-champion units a chance to miss their attacks.\n", " Shaco throws a dagger at a target enemy dealing magic damage and applying his slowing poison to them for 3 seconds. The passive is deactivated during the cooldown.\n", "\n", " Shaco becomes stealthed and untargetable for 0.5 seconds, then creates a clone of himself that will last for up to 18 seconds. The clone deals 75% of Shaco's damage and receives 50% extra damage. This clone deals 50% damage to towers and inhibitors. At the end of its duration or when dying the clone will explode, dealing magic damage to nearby enemies.\n", "Additional Information:\n", "\n", "\n", "\n"]},
{"url": "http://leagueoflegends.wikia.com/wiki/Skarner", "urldoc": ["Skarner", "the Crystal Vanguard", " ", " ", " or ", " ", " ", " ", "Release date", "Each basic attack reduces Skarner's ability cooldowns by 0.", " seconds. The effect is doubled when attacking enemy champions. Attacking structures will not trigger Energize.\n", "\n", " Skarner deals physical damage to all enemies within range. Hitting an enemy will grant a stacking attack speed bonus for 5 seconds that stacks up to 3 times. While Skarner has stacks, Crystal Slash deals bonus magic damage.\n", "Additional Information:\n", "\n", " Skarner gains a health shield for 6 seconds. While the shield is active, Skarner gains an accelerating movement speed that reaches full strength after 3 seconds.\n", "Additional Information:\n", "\n", " Skarner deals magic damage to all enemies in a line and slows them for 2.", " seconds.\n", "\n", " Skarner rears his stinger, immobilizing his target with fear for ~0.", " seconds as he bring his stinger down: dealing magic damage and suppressing them for 1.", " seconds. For the duration, Skarner can move freely and will drag his victim around with him. At the end of the suppression, the target takes the same damage again.\n", "If Skarner loses sight of his target or if his target exceeds a range threshold during the ~0.", " seconds, the ability is canceled but does not go on cooldown.\n", "Additional Information:\n", "\n", "\n\t", "\n\tYou can find discussions about everything related to this wiki on "]},
{"url": "http://leagueoflegends.wikia.com/wiki/Shen", "urldoc": ["Shen", "Eye of Twilight", " ", " ", " or ", " ", " ", " ", "Release date", "Shen's next basic attack deals bonus magic damage equal to 4 + (4 × Shen's level) + ", " and restores ", " / ", " / ", " energy. Cooldown reduction does not affect Ki Strike, but Shen's basic attacks will reduce the cooldown of Ki Strike by 1 second each.\n", "\n", " Shen throws a blade at the target enemy, dealing magic damage and marking them for 5 seconds. Shen and allied champions that damage a marked enemy will heal over 3 seconds, with the duration refreshing upon subsequent damage.\n", "If Vorpal Blade kills the target, Shen heals for 33% of the normal amount instantly.\n", "Additional Information:\n", "\n", " Shen gains a shield that absorbs a certain amount of damage. The shield dissipates after 3 seconds if not already destroyed. While the shield persists, Shen's basic attacks reduce the cooldown of Ki Strike by 2 seconds.\n", "Additional Information:\n", "\n", " Shen dashes along target line, dealing magic damage to enemy champions he contacts and taunting them for 1.5 seconds. While taunted, enemies are forced to attack Shen and their basic attacks deal half damage. Shen gains 40 energy for each enemy champion he contacts.\n", "\n", " Target allied champion gains a shield that absorbs a certain amount of damage. The shield dissipates after 5 seconds if not already destroyed. After 3 seconds of channeling, Shen teleports to the allied champion.\n", "Additional Information:\n", "\n"]},
{"url": "http://leagueoflegends.wikia.com/wiki/Olaf", "urldoc": ["Olaf", "the Berserker", " ", " ", " or ", " ", " ", " ", "Release date", "Olaf's attack speed increases by 1% for every ", ".\n", "\n", " Olaf throws an axe in a line to a target location, dealing physical damage and slowing enemies it passes through for between 1.", " and 2.", " seconds, depending on the distance the axe has travelled.\n", "The axe remains at the target location until Undertow is off cooldown. Olaf can pick up the axe to reduce Undertow's cooldown by 4.", " seconds. If the axe would land inside terrain, it will instead stick to the wall.\n", "Additional Information:\n", "\n", " For 6 seconds, Olaf gains bonus lifesteal and bonus attack speed. During this time, Olaf also gains 1% enhanced healing from all sources for every 2.", "% of his missing health.\n", "Additional Information:\n", "\n", " Olaf attacks with such force that it deals true damage to his target. The ability's cost is equal to 30% of the damage dealt and the cost is refunded if ", " kills the target. \n", "Olaf's basic attacks will reduce the cooldown of ", " by 1 second.\n", "Additional Information:\n", "\n", " Olaf gains bonus armor and magic resistance.\n", " Olaf instantly removes all crowd control effects from himself and becomes immune to them for 6 seconds. During this time, he loses the passive bonus but gains bonus attack damage.\n", "Additional Information:\n", "\n", "\n\t", "\n\tYou can find discussions about everything related to this wiki on "]},
{"url": "http://leagueoflegends.wikia.com/wiki/Shyvana", "urldoc": ["Shyvana", "the Half-Dragon", " ", " ", " or ", " ", " ", " ", "Release date", "Shyvana's abilities have no cost related to them, and the use of her abilities is only limited by cooldowns. Instead she uses Fury as her secondary resource.\n", "Fury is only needed as a requirement for the use of her ultimate ", ", which allows her to change form if she has 100 Fury and remain in that state for as long as she has Fury. Shyvana won't generate Fury unless she has at least one point in ", ", and once she puts the first point on the skill she will gain 100 Fury immediately. Any gained Fury cannot be lost except by depletion during Dragon Form.\n", "Shyvana gains ", " / ", " / ", " / ", " armor and magic resist. These bonuses are doubled in Dragon Form.\n", "\n", " Shyvana's next autoattack will strike twice in one swift movement. The second attack will deal physical damage equal to a percentage of her total attack damage. Both attacks will trigger on-hit effects. Shyvana's autoattacks against non-structures reduce the cooldown of ", " by 0.", " seconds.\n", " ", " will damage all units in front of Shyvana when she uses her next autottack instead of just her target. Each unit hit will both trigger on-hit effects and grant fury twice.\n", "Additional Information:\n", "\n", " Shyvana surrounds herself in flame for 3 seconds, dealing magic damage to enemies within 162.", " range each second and gaining bonus movement speed. The bonus movement speed decreases by 15% of its original value per second. Shyvana's autoattacks extend the duration of ", " by 1 second, to a maximum of 4 extra seconds. \n", " Shyvana now scorches the earth where she walks, leaving a trail of fire for 5 seconds that will continually deal the same magic damage per second to enemies that pass over it.\n", "Additional Information:\n", "\n", " Shyvana unleashes a fireball that travels in a line, dealing magic damage and marking enemies hit for 5 seconds. Basic attacks against marked enemies deal bonus magic damage equal to ", " (max. 100 vs. ", ").\n", " ", " engulfs all units in a cone in front of Shyvana.\n", "Additional Information:\n", "\n", " Shyvana's basic attacks generate 2 fury, even in Dragon Form or against structures. While in human form, Shyvana passively generates fury every 1.", " seconds.\n", " Shyvana transforms into a dragon (more exactly a Wyvern) and dashes to a target location. Enemies along her path take magic damage and are pushed toward her target location. While in Dragon Form, Shyvana's fury decays at a rate of 5 per second. Once her fury is depleted, she will return to her normal state.\n", "Dragon's Descent has no cooldown or initial cost but can only be activated when Shyvana has 100 fury.\n", "Additional Information:\n", "\n", "\n\t", "\n\tYou can find discussions about everything related to this wiki on "]},
{"url": "http://leagueoflegends.wikia.com/wiki/Sona", "urldoc": ["Sona", "Maven of the Strings", " ", " ", " or ", " ", " ", " ", "Release date", "Sona's basic abilities use the ", " mechanic. In addition to their activation effects, her basic abilities each grant a unique and persistent aura until she activates a different basic ability to change stance. The previous aura persists for 1 more second after Sona enters a different stance. Changing stances sets off a 0.", " second cooldown on Sona's basic abilities.\n", "After 3 ability casts, Sona's next basic attack will deal \n", " / ", " / ", " / ", " / ", " / ", " / ", " / ", " / ", " / ", " / ", " / ", " / ", " / ", " / ", " / ", " / ", " / ", " (6 + ", " / ", " / ", " / ", " / ", " at each level) ", " bonus magic damage, with an additional effect depending on the last basic ability cast.\n", "Additional Information:\n", "\n", " Sona sends out bolts of sound that deal magic damage to the two nearest enemy units within range, prioritizing champions.\n", " Sona plays the Hymn of Valor, granting nearby allied champions within 1000 range bonus attack damage and ability power.\n", "\n", " If this spell was last cast when Power Chord is ready, Power Chord deals double damage.\n", "Additional Information:\n", "\n", " Sona heals herself and a nearby allied champion with the lowest health percentage, granting both of them bonus armor and magic resistance for 3 seconds.\n", "\n", " Sona plays the Aria of Perseverance, granting nearby allied champions within 1000 range bonus armor and magic resistance.\n", "\n", " If this spell was last cast when Power Chord is ready, Power Chord will also reduce the target's damage output by 20% ", " for 3 seconds.\n", "Additional Information:\n", "\n", " Sona grants nearby allies increased movement speed for 1.", " seconds.\n", "\n", " Sona plays the Song of Celerity, granting nearby allied champions within 1000 range  a flat movement speed bonus.\n", "\n", " If this spell was last cast when Power Chord is ready, Power Chord will also slow the target by 40% ", " for 2 seconds.\n", "Additional Information:\n", "\n", " Sona plays an irresistible chord in a line, dealing magic damage to enemy champions and stunning them for 1.", " seconds, forcing them to dance.\n", "Additional Information:\n", "\n", "\n\t", "\n\tYou can find discussions about everything related to this wiki on "]},
{"url": "http://leagueoflegends.wikia.com/wiki/Swain", "urldoc": ["Swain", "the Master Tactician", " ", " ", " or ", " ", " ", " ", "Release date", "Whenever Swain kills an enemy unit, he regains 9 + (1 × level) mana. On a champion kill or assist, he regains an additional 9% of his maximum mana pool.\n", "Additional Information:\n", "\n", " Swain releases his raven at his current location to cripple an enemy, creating a tether between the target and the raven. Over the next 3 seconds, the target takes magic damage each second and is slowed. If enemies walk out ", " range of the tether, the effect ends immediately.\n", "Additional Information:\n", "\n", " Swain marks a target ", "-radius area. After a ", " talons grab onto enemy units within the area, dealing magic damage and rooting them for 2 seconds.\n", "\n", " Swain afflicts his target with a curse that deals magic damage to them over 4 seconds, and causes any further damage dealt by Swain during this period to be increased by a percentage. This includes items used by Swain.\n", "Additional Information:\n", "\n", " Swain transforms into the form of a vicious raven. During this time up to 3 lesser ravens strike out each second to deal magic damage to nearby enemies, one raven per enemy and prioritizing champions. Swain is healed for 75% of the damage dealt to champions and 25% of the damage dealt to minions and monsters. The mana cost to sustain Ravenous Flock increases every second.\n", "Additional Information:\n", "\n", "\n\t", "\n\tYou can find discussions about everything related to this wiki on "]},
{"url": "http://leagueoflegends.wikia.com/wiki/Rumble", "urldoc": ["Rumble", "the Mechanized Menace", " ", " ", " or ", " ", " ", " ", "Release date", "Rumble's abilities have no cost related to them, and the use of his abilities is only limited by cooldowns. Instead, he uses Heat as his secondary resource. Rumble starts with 0 Heat, and it caps at 100.\n", "Rumble's basic abilities generate 20 Heat when used. When Rumble reaches 50 Heat, he is in the Danger Zone, causing all of his basic abilities to have enhanced effects. When Rumble reaches 100 Heat he overheats for 6 seconds; during this time he may not use his own abilities, but all his basic attacks deal additional magic damage. While not overheated, after 4 seconds of not using his basic abilities he will start losing Heat at a rate of 10 Heat per second, then at a rate of 20 Heat per second 2.", " seconds later.\n", "When Rumble reaches 100 Heat he overheats for 6 seconds. While overheated Rumble cannot use his own spells, but his basic attacks deal an additional 20 + (5 × level) ", " magic damage. Rumble's Heat is reset to 0 after the overheat effect ends.\n", "Additional Information:\n", "\n", " Rumble activates his flamethrower for 3 seconds, dealing magic damage every 0.", " seconds to enemy units in a cone in front of him (dealing half damage to minions). Rumble can perform other actions while Flamespitter is active.\n", "While in the \"Danger Zone\", the damage is increased by 50%.\n", "Additional Information:\n", "\n", " Rumble pulls up a shield, protecting him from damage for up to 2 seconds. In addition, he gains a quick burst of speed for 1 second.\n", "While in the \"Danger Zone\", the shield strength and movement speed bonus are increased by 25%.\n", "Additional Information:\n", "\n", " Rumble shoots a taser that deals magic damage and applies a slow on the first enemy it hits for 3 seconds. A second shot can be fired for no additional cost within the next 3 seconds, even if Rumble overheats. If the second taser slows an enemy that has been slowed by the first, the slow is refreshed and its movement speed reduction is doubled.\n", "While in the \"Danger Zone\", the damage and slow percentage are increased by 25%.\n", "Additional Information:\n", "\n", " Rumble calls down a line of rockets over the target linear location, using a click and drag targeting system. The rockets leave a trail of destruction for 5 seconds, dealing magic damage every second and slowing all enemies standing on the area by 35%.\n", "Additional Information:\n", "\n", "\n\t", "\n\tYou can find discussions about everything related to this wiki on "]},
{"url": "http://leagueoflegends.wikia.com/wiki/Sivir", "urldoc": ["Sivir", "the Battle Mistress", " ", " ", " or ", " ", " ", "Release date", "Sivir gains ", " / ", " / ", " / ", " / ", " movement speed for 2 seconds when she hits an enemy champion with her abilities or basic attacks.\n", " Sivir hurls her crossblade to a target location, which then returns to her. Enemies in its path take physical damage, with 10% reduced damage to each subsequent target, down to a minimum of 40%. Each enemy can be damaged only twice.\n", "Additional Information:\n", "\n", " Sivir's next 3 basic attacks bounce to nearby enemies, dealing a percentage of her attack damage to each additional enemy hit. There is no limit on how many enemies that can be hit, but each  enemy unit can only be hit once per attack.\n", "Additional Information:\n", "\n", " Sivir creates a magical barrier that lasts up to 1.", " seconds, blocking the next enemy ability used on Sivir. If an ability is blocked by the shield, Sivir gains mana.\n", "Additional Information:\n", "\n", " Sivir gains bonus Attack Speed while ", " is active.\n", " Sivir rallies her allies for 8 seconds, granting all nearby allies an initial 60% Movement Speed bonus that reduces to 20% after a few seconds.\n", "Additional Information:\n", "\n"]},
{"url": "http://leagueoflegends.wikia.com/wiki/Soraka", "urldoc": ["Soraka", "the Starchild", " ", " ", " or ", " ", " ", " ", "Release date", "silence\n", "Soraka's health and mana restoring abilities are 1% more powerful for every 2% of the target's missing health or mana.\n", " Soraka summons a shower of stars to fall from the sky, striking all nearby enemy units within range for magic damage and reducing their magic resistance by 6 ", " for 5 seconds. This effect stacks up to 10 times.\n", "If Starcall hits at least one enemy champion, ", " cooldown is reduced by a percentage of its base cooldown (after factoring in cooldown reduction).\n", "Additional Information:\n", "\n", " Soraka blesses a friendly unit, restoring health and granting them bonus armor for 2 seconds.\n", "\n", " Soraka drains 5% of her maximum mana to restore mana to her target ally. Soraka cannot use Infuse on herself or champions who do not require mana.\n", " Soraka silences the target and deals magic damage to them.\n", "Additional Information:\n", "\n", " Soraka fills her allies with hope, restoring health to herself and all friendly champions. Wish can affect untargetable allies.\n", "Additional Information:\n", "\n", "\n", "\n"]},
{"url": "http://leagueoflegends.wikia.com/wiki/Thresh", "urldoc": ["Thresh", "the Chain Warden", " ", " ", " or ", " ", " ", " ", "Release date", "Thresh does not gain ", " per ", ". Instead, Thresh collects the souls of dead enemies by approaching them or by placing Dark Passage's lantern nearby. Each soul permanently grants 0.75 armor and ", ". Champions and large ", " and ", " always drop a soul. Small minions and monsters only sometimes drop a soul.\n", "A soul will only drop if the enemy unit dies within 1900 range of Thresh. Souls are visible to allies, and only become visible to enemies if the enemy team has vision of Thresh. Souls disappear if not picked up after 14 seconds.\n", "Additional Information:\n", "\n", " After a 0.", " second wind-up, Thresh throws out his scythe in a line and forms a tether with the first enemy hit, dealing ", " and ", " it for 1.", " seconds. Upon hitting an enemy, Death Sentence's current ", " is reduced by 3 seconds.\n", "While the tether persists, Thresh cannot attack and he will periodically tug on the tether, each time pulling the target a short distance toward himself. After 0.", " seconds, or instantly if he hooks a minion or monster, Thresh can reactivate the ability to use Death Leap.\n", " Thresh pulls himself to the bound enemy. This removes the stun but allows Thresh to attack again. Thresh loses the ability to activate Death Leap when the tether breaks.\n", "\n", " Thresh throws his lantern to the target location where it remains for up to 6 seconds. If an ally right-clicks the lantern, they will pick it up and will be pulled to Thresh's location. If Thresh moves more than ~1500 units away, the lantern will return to him. \n", "For the next 6 seconds, allies who come near the lantern (even while Thresh is holding it) gain a shield that absorbs damage for up to 4 seconds. Allies can only receive the shield once per cast.\n", "Additional Information:\n", "\n", " Thresh's basic attacks deal bonus magic damage on each hit. This value is equal to the total number of souls collected, plus a percentage of his attack damage based on the amount of time since his last attack.\n", " Thresh sweeps his chain in a broad line towards a target direction. Enemies hit take magic damage, are knocked in the same direction as the chains, and are slowed afterwards for 1.", " seconds.\n", "Additional Information:\n", "\n", " After a 0.", " second delay, Thresh summons 5 spectral walls around him that last up to 5 seconds. Enemy champions that touch a wall take magic damage and are slowed by 99% for 2 seconds, but break the wall. Once one wall is broken, the remaining walls deal half damage and apply half the slow duration. An enemy can be affected by multiple walls.\n", "Additional Information:\n", "\n", "\n", "\n"]},
{"url": "http://leagueoflegends.wikia.com/wiki/Teemo", "urldoc": ["Teemo", "the Swift Scout", " ", " ", " or ", " ", " ", " ", "Release date", "If Teemo stands still and takes no action for 2 seconds, he becomes stealthed. Taking any action will break his camouflage, granting him 40% attack speed for 3 seconds.\n", "Additional Information:\n", "\n", " Teemo shoots a dart at an enemy, dealing magic damage and ", " them for a few seconds.\n", "\n", " Teemo gains increased movement speed. Damage from champions and structures will disable this bonus for 5 seconds.\n", " For 3 seconds, Teemo doubles his passive movement speed bonus. While active, Move Quick's bonus cannot be disabled via champion or structure damage.\n", "Additional Information:\n", "\n", " Teemo's auto-attacks deal bonus magic damage and poison his target, causing them to take additional magic damage over 4 seconds. Subsequent attacks only refresh the duration.\n", "Additional Information:\n", "\n", " Teemo places a mushroom trap on the ground, which stealths and arms after 1 second. While armed, the traps grant vision in a 212.", " radius. If an enemy comes within 60 range of the trap, it will detonate, slowing and dealing damage over 4 seconds to nearby enemies within 200 radius. Each mushroom has 100 health and can only be destroyed by auto-attacks.\n", "Noxious Traps have a 10 minute duration. Teemo generates a new trap periodically, affected by cooldown reduction, and can only store up to 3 traps at once.\n", "Additional Information:\n", "\n"]},
{"url": "http://leagueoflegends.wikia.com/wiki/Taric", "urldoc": ["Taric", "the Gem Knight", " ", " ", " or ", " ", " ", " ", "Release date", "After using an ability, Taric's next basic attack deals bonus magic damage equal to ", " and reduces his abilities' cooldown by 2 seconds.\n", "Additional Information:\n", "\n", " Taric channels earthen energy to heal a target allied unit. As the magic flows through them he is healed for the same amount. If Taric heals only himself, the heal will be 40% more effective.\n", "Additional Information:\n", "\n", " Taric reinforces his armor with gemstones, increasing his armor while Shatter is off cooldown. He also gains a 500-range aura increasing his armor and allied champions' armor by ", ".\n", " Taric shatters his gemstones, dealing magic damage to nearby enemies within 200 range and reducing their armor for 4 seconds.\n", "Additional Information:\n", "\n", " Taric fires a prismatic sphere at a target enemy. On impact the target is stunned and takes magic damage that increases the closer the target is to Taric (up to 200%).\n", "\n", " Taric slams the ground with his hammer, dealing magic damage to enemies within range. For the next 10 seconds, Taric emits an aura of light that increases his attack damage and ability power, while allies within 500 range gain half of those bonuses.\n", "Additional Information:\n", "\n", "\n\t", "\n\tYou can find discussions about everything related to this wiki on "]},
{"url": "http://leagueoflegends.wikia.com/wiki/Tryndamere", "urldoc": ["Tryndamere", "the Barbarian King", " ", " ", " or ", " ", " ", " ", "Release date", "Tryndamere's abilities have no cost related to them, and the use of his abilities is only limited by cooldowns. Instead he uses Fury as his secondary resource. Tryndamere starts with 0 Fury, and has a cap of 100 Fury. He gains 5 Fury per autoattack, plus 5 extra Fury per critical strike and 10 extra Fury per any unit he kills. Using Spinning Slash on enemies also grants Fury. When out of combat for 8 seconds, Tryndamere loses 5 Fury every second.\n", "Tryndamere receives 0.", "% bonus critical strike chance per point of Fury he currently has, for a maximum of 35% critical chance at 100 Fury.\n", "Additional Information:\n", "\n", " Permanently grants Tryndamere increased attack damage, granting a larger bonus per 1% of health he is missing.\n", " Tryndamere consumes all of his current Fury, restoring health equal to a base amount plus extra health per point of Fury consumed.\n", "Additional Information:\n", "\n", " Decreases surrounding enemy champions' attack damage. Enemies with their backs turned to Tryndamere also have their movement speed slowed for 4 seconds.\n", "Additional Information:\n", "\n", " Tryndamere performs a spinning slash to the target location, dealing physical damage to enemies in his path. The cooldown is reduced by 1 seconds whenever Tryndamere critically strikes and doubled against champions (2 seconds).\n", "Spinning Slash grants 2 Fury per enemy hit and 10 Fury per unit killed.\n", "\n", " Tryndamere instantly receives Fury and becomes immune to death for 5 seconds during which his health cannot fall below 1. This move is usable even when stunned, silenced or suppressed. This ability has a 0.", " second delay before activating.\n", "If Tryndamere is below 3% health when Undying Rage ends, it will heal him to 3%.\n", "Additional Information:\n", "\n", "\n\t", "\n\tYou can find discussions about everything related to this wiki on "]},
{"url": "http://leagueoflegends.wikia.com/wiki/Twisted_Fate", "urldoc": ["Twisted Fate", "the Card Master", " ", " ", " or ", " ", " ", "Release date", "Upon killing a unit, Twisted Fate rolls his dice, gaining from 1 to 6 bonus gold. Naturally, Twisted Fate has a higher chance to receive a larger bonus.\n", "Additional Information:\n", "\n", " Twisted Fate throws 3 cards forward in an arc, dealing magic damage to enemies they pass through.\n", "Additional Information:\n", "\n", " When first activated, cards flash over Twisted Fate's head in the following order: blue, then red, then gold (this cycle repeats itself). When he uses the ability again, he picks the current card over his head; the card picked converts his next basic attack within 4 seconds to deal magic damage and adds a special effect.\n", "Twisted Fate's next basic attack will deal magic damage and will restore mana.\n", "Twisted Fate's next basic attack will deal magic damage to both the target and all enemies within 100 range of the target. All damaged enemies will also be slowed for 2.", " seconds.\n", "Twisted Fate's next basic attack will deal magic damage and stun the target.\n", "Additional Information:\n", "\n", " Every fourth basic attack will deal bonus magic damage. In addition, Twisted Fate gains bonus attack speed.\n", "Additional Information:\n", "\n", "\n", " Twisted Fate reveals all enemy champions, including stealthed champions, for a few seconds. While Destiny is active, Twisted Fate can use Gate once.\n", " After channeling for 1.5 seconds, Twisted Fate teleports to the target location within range.\n", "Gate is a ", ", ground targeted ", ".\n", "Additional Information:\n", "\n", "\n", "\n\t", "\n\tYou can find discussions about everything related to this wiki on "]},
{"url": "http://leagueoflegends.wikia.com/wiki/Trundle", "urldoc": ["Trundle", "the Troll King", " ", " ", " or ", " ", " ", " ", "Release date", "Whenever an enemy unit near Trundle dies, he absorbs its life force and heals for ", " / ", " / ", " / ", " / ", "% of its maximum health.\n", "Additional Information:\n", "\n", " Trundle bites his target with this next basic attack, dealing physical damage equal to a base amount plus a percentage of his attack damage and slowing his target by 75% for 0.", " seconds.\n", "This attack increases Trundle's attack damage for 8 seconds, with his opponent losing half of this amount for the same duration.\n", "Additional Information:\n", "\n", " Trundle coats a target ", "-radius area with ice for 8 seconds, gaining increased movement speed, attack speed, and healing and regeneration from all sources while he is on it.\n", "\n", " Trundle summons an impassable pillar of ice at a target location for 6 seconds. Enemies caught in the center of the eruption are briefly knocked back. The pillar blocks movement within 62.5 range and slows enemies within ", " range.\n", "Additional Information:\n", "\n", " Trundle drains the life force out of an enemy champion, dealing magic damage equal to a percentage of their maximum health and healing himself for the same amount, as well as stealing 40% of their armor and magic resist. Half of the health, armor, and magic resist is drained immediately and the other half over the next 4 seconds.\n", "The armor and magic resist bonus/reduction slowly decays over 4 seconds after the drain completes.\n", "Additional Information:\n", "\n", "\n\t", "\n\tYou can find discussions about everything related to this wiki on "]},
{"url": "http://leagueoflegends.wikia.com/wiki/Twitch", "urldoc": ["Twitch", "the Plague Rat", " ", " ", " or ", " ", " ", " ", "Release date", "Twitch's basic attacks apply a stack of Deadly Venom, dealing ", " / ", " / ", " / ", " true damage per second for 6 seconds. This effect can stack up to 6 times for a minimum of ", " / ", " / ", " / ", " and maximum of ", " / ", " / ", " / ", " total true damage over the duration.\n", "Additional Information:\n", "\n", " For 1.", " seconds, Twitch attempts to enter stealth, which may be delayed by up to 3 seconds if he takes damage before he goes invisible. While in stealth, Twitch gains 20% bonus movement speed.\n", "When Twitch unstealths, he gains bonus attack speed for 5 seconds. Casting spells or attacking will end his stealth prematurely.\n", "Additional Information:\n", "\n", " Twitch hurls a cask of venom at an area, infecting struck enemies with 2 stacks of Deadly Venom and slowing them for 3 seconds.\n", "\n", " Twitch expunges all nearby enemies afflicted by Deadly Venom, dealing physical damage equal to a base amount plus bonus damage for each stack of Deadly Venom on an enemy.\n", "Additional Information:\n", "\n", " For 7 seconds, Twitch gains bonus attack damage and 300 attack range. Additionally, each of his basic attacks will pierce enemies in an 850 length line, with each unit struck reducing the attack's damage by 20% down to a minimum of 40% damage.\n", "Additional Information:\n", "\n", "\n\t", "\n\tYou can find discussions about everything related to this wiki on "]},
{"url": "http://leagueoflegends.wikia.com/wiki/Varus", "urldoc": ["Varus", "the Arrow of Retribution", " ", " ", " or ", " ", " ", " ", "Release date", " is a ", " in ", ".", "\n", "On a champion kill or assist, Varus gains 40% attack speed for 6 seconds. On a minion or monster kill, Varus gains 20% attack speed for 3 seconds.\n", "Additional Information:\n", "\n", " Varus starts drawing back his next shot, gradually increasing its range and damage. Maximum range is achieved in 2 seconds.\n", "While preparing to shoot, Varus cannot autoattack or use his other abilities, and his movement speed is slowed by 20%. After 4 seconds, Piercing Arrow is automatically cancelled, going on full cooldown and refunding half of its mana cost.\n", " Varus fires, dealing physical damage to all enemies in the arrow's path, reduced by 15% per enemy hit (down to a minimum of 33%).\n", "Additional Information:\n", "\n", " Varus' basic attacks deal bonus magic damage. They also apply Blight for 6 seconds, stacking up to 3 times.\n", "Varus' other abilities detonate Blight, dealing magic damage equal to a percentage of the target's maximum health per stack. This damage is capped at 360 against monsters.\n", "\n", " Varus fires a hail of arrows that deals physical damage and desecrates the ground for 4 seconds.\nDesecrated Ground inflicts Grievous Wounds and slows enemy movement speed.\n", "Additional Information:\n", "\n", " Varus flings out a tendril of corruption that infects the first enemy champion hit, dealing magic damage and rooting them for 2 seconds.\n", "The corruption then attempts to spread towards enemy champions within 550 range, applying the same damage and root if they stay within 600 range of the infected champion for 2 seconds. The corruption will continue to spread until there are no further targets in range, but each champion may only be infected once per cast.\n", "Additional Information:\n", "\n", "\n\t", "\n\tYou can find discussions about everything related to this wiki on "]},
{"url": "http://leagueoflegends.wikia.com/wiki/Tristana", "urldoc": ["Tristana", "the Megling Gunner", " ", " ", " or ", " ", " ", " ", "Release date", "Tristana's attack range and Explosive Shot's cast range increases by 9 every level (excluding level 1). At level 18, the bonus is 153 (703 range at level 18).\n", "Additional Information:\n", "\n", "\n", " Increases Tristana's attack speed for 7 seconds.\n", "Additional Information:\n", "\n", "\n", " Tristana fires at the ground to propel herself to a target location, dealing magic damage and slowing surrounding units by 60% for 2.", " seconds when she lands. Rocket Jump's cooldown resets whenever Tristana gains a kill or assist.\n", "Additional Information:\n", "\n", "\n", " Enemies explode when slain by Tristana's basic attacks, dealing magic damage to enemies within 75 range.\n", " Rends the target enemy with shrapnel, reducing healing and health regeneration by 50% and dealing magic damage over 5 seconds.\n", "Additional Information:\n", "\n", "\n", " Tristana fires a massive cannonball at an enemy unit, dealing magic damage and knocking them and surrounding units back.\n", "Additional Information:\n", "\n", "\n", "\n\t", "\n\tYou can find discussions about everything related to this wiki on "]},
{"url": "http://leagueoflegends.wikia.com/wiki/Urgot", "urldoc": ["Urgot", "the Headsman's Pride", " ", " ", " or ", " ", " ", " ", "Release date", " is a ", " in ", ".", "\n", "Urgot's autoattacks and Acid Hunter reduce all damage that his target deals by 15% for 2.", " seconds.\n", "Additional Information:\n", "\n", " Urgot fires a missile in a line towards the cursor, dealing physical damage to the first enemy it hits. His passive is also applied to the target.\n", "Missile-lock can be achieved by holding the cursor over a unit afflicted by Noxian Corrosive Charge when casting, causing Acid Hunter to fly directly to the target ignoring all other units. Acid Hunter can lock onto units hidden in Fog of War, brush, and in stealth, but it will not reveal targets hit.\n", "Additional Information:\n", "\n", " Urgot charges up his capacitor to gain a shield that absorbs damage for up to 7 seconds. While the shield is active, Urgot's autoattacks and Acid Hunter missiles will slow targets for 1.", " seconds.\n", "Additional Information:\n", "\n", " Urgot launches a corrosive charge at target 150-radius area, afflicting all targets hit for 5 seconds. Enemies afflicted by the charge have their armor reduced by a percentage and take physical damage over the duration.\n", "Additional Information:\n", "\n", " Urgot targets an enemy champion and channels for 1 second, suppressing the target for the duration. If the channel completes, Urgot and the target will swap positions and the target will be slowed by 40% for 3 seconds. Urgot also gains bonus armor and magic resistance for 5 seconds, starting from the beginning of the channel time.\n", "Additional Information:\n", "\n", "\n\t", "\n\tYou can find discussions about everything related to this wiki on "]},
{"url": "http://leagueoflegends.wikia.com/wiki/Syndra", "urldoc": ["Syndra", "the Dark Sovereign", " ", " ", " or ", " ", " ", " ", "Release date", "Each of Syndra's abilities gain an extra effect at maximum rank.\n", "Additional Information:\n", "\n", " Conjures a Dark Sphere at a target location, dealing magic damage. The sphere lasts for up to 6 seconds and can be manipulated by Syndra's other abilities.\n", " Deals 15% bonus damage against Champions.\n", "Additional Information:\n", "\n", " Grabs a dark sphere, enemy minion or neutral monster for 5 seconds. If a dark sphere is grabbed, its duration is refreshed. If a minion or monster is grabbed, it becomes untargetable, invulnerable, and disabled until released.\n", " Throws the grasped Dark Sphere or enemy at a target area. The thrown unit, if it is an enemy, and any enemies struck take magic damage and are slowed for 1.5 second. This ability also provides vision through fog of war or brushes before it lands.\n", " Increases the slowing duration to 2 seconds.\n", "Additional Information:\n", "\n", " Knocks enemies and Dark Spheres back, dealing magic damage to them and any enemies with which they collide. The distance of the knockback increases depending on how close the affected units are to Syndra upon cast. Dark Spheres that are knocked back also stun all enemies in their path for 1.5 seconds.\n", " Spell width increased by 50%.\n", "Additional Information:\n", "\n", " Draws upon Syndra's full cataclysmic power, harnessing all Dark Spheres to deal magic damage to her target per sphere. Unleashed Power will  use the three spheres that orbit Syndra, ensuring a minimum damage.\n", "All Dark Spheres remain on the ground for 6 seconds after Unleashed Power is used.\n", " Cast range increased by 75.\n", "Additional Information:\n", "\n"]},
{"url": "http://leagueoflegends.wikia.com/wiki/Vayne", "urldoc": ["Vayne", "the Night Hunter", " ", " ", " or ", " ", " ", " ", "Release date", " is a ", " in ", ".", "\n", "Vayne gains 30 movement speed when moving towards a visible enemy champion.\n", "Additional Information:\n", "\n", " Vayne quickly rolls toward the cursor's location, causing her next basic attack within 6 seconds to deal bonus damage. This ability resets the autoattack timer on cast.\n", "Additional Information:\n", "\n", " Consecutive attacks and abilities mark Vayne's target with silver rings. The third consecutive attack or spell against the same target will consume the rings, dealing true damage equal to a flat amount plus a percentage of the target's maximum health (capped at 200 against monsters).\n", "The rings are removed if Vayne attacks a different target or doesn't attack for 3 seconds.\n", "Additional Information:\n", "\n", " Vayne fires a projectile at target unit, dealing physical damage and knocking the target back 470 units. If the target is knocked into a wall, the target takes the same damage again and is stunned for 1.", " seconds. Condemn also applies Silver Bolts once.\n", "Additional Information:\n", "\n", " Vayne temporarily gains attack damage and enhances her other abilities. While Final Hour is active, Night Hunter's movement speed increase is tripled, and using Tumble stealths Vayne for 1 second.\n", "Additional Information:\n", "\n", "\n", "\n\t", "\n\tYou can find discussions about everything related to this wiki on "]},
{"url": "http://leagueoflegends.wikia.com/wiki/Veigar", "urldoc": ["Veigar", "the Tiny Master of Evil", " ", " ", " or ", " ", " ", "Release date", " is a ", " in ", ".", "\n", "Veigar's mana regeneration is increased by 1% for each 1% of his missing mana.\n", "Additional Information:\n", "\n", " Veigar gains permanent bonus ability power when he kills a champion from any source of damage. This stacks with the active ability's AP gain.\n", " Unleashes dark energy at target enemy, dealing magic damage. If this ability deals a killing blow, Veigar gains 1 ability power permanently. This bonus is doubled for large minions, large monsters, and champions.\n", "Additional Information:\n", "\n", " Veigar calls a great mass of dark matter to fall from the sky to the target location, which lands after a 1.", " second delay, dealing magic damage in a 112.", "-radius area. This ability also provides sight of the target area through fog of war or brushes before it lands.\n", "Additional Information:\n", "\n", " Veigar twists the edges of space around the 375-radius target area for 3 seconds, stunning enemies who pass through the perimeter for a short duration.\n", "Additional Information:\n", "\n", " Blasts an enemy champion, dealing magic damage equal to a base amount plus 80% of the target's ability power.\n", "\n", "\n\t", "\n\tYou can find discussions about everything related to this wiki on "]},
{"url": "http://leagueoflegends.wikia.com/wiki/Udyr", "urldoc": ["Udyr", "the Spirit Walker", " ", " ", " or ", " ", " ", " ", "Release date", "Udyr uses the ", " mechanic. His abilities all have a persistent effect which remain until he activates another ability. Each ability also has a temporary activation effect that occurs upon being cast; the temporary effect of each stance persists for its full duration even if Udyr changes stance again. Switching stances sets off a 2 second global cooldown.\n", "All of Udyr's abilities have 5 ranks, but as Udyr can only gain a maximum of 18 skill points at level 18, he cannot ever max out all of his abilities. He may max three abilities (with the fourth only reaching its 3rd rank) or he may max two abilities (with the other two reaching their 4th rank).\n", "Each time Udyr switches stances, he gains 5 flat movement speed and 10% attack speed for 5 seconds. This effect can stack up to 3 times.\n", "Additional Information:\n", "\n", " Udyr gains attack speed for 5 seconds.  Udyr's first attack after activation will deal bonus physical damage over 2 seconds to the target.\n", "  Udyr's basic attacks deal bonus physical damage equal to ", ".\n", "Additional Information:\n", "\n", " Udyr gains a shield for 5 seconds.\n", " Udyr gains life steal.\n", "Additional Information:\n", "\n", " Udyr gains increased movement speed and ignores unit collision for a few seconds.\n", " Udyr's basic attacks cause him to dash a short distance closer to his target and stun it for 1 second. The dash and stun cannot reoccur on the same target within 6 seconds.\n", "\n", " Udyr unleashes pulsing waves of fire around himself for 5 seconds, dealing magic damage each second to enemies within 250 range.\n", " On the first attack after activation and on every third subsequent attack, Udyr engulfs enemies in flames, dealing magic damage in a cone in front of him.\n", "Additional Information:\n", "\n", "\n\t", "\n\tYou can find discussions about everything related to this wiki on "]},
{"url": "http://leagueoflegends.wikia.com/wiki/Vel%27Koz", "urldoc": ["Vel'Koz", "the Eye of the Void", " ", " ", " or ", " ", " ", "Release date", "Vel'Koz's damaging abilities apply stacks of Deconstruction for 7 seconds, stacking up to 3 times. Upon reaching 3 stacks, the stacks detonate and the target suffers 25 + (10 × level) true damage. Basic attacks will refresh the duration, but will not add additional stacks.\n", "\n", " Vel'Koz fires a bolt of energy that deals magic damage and slows the first enemy hit by 70% for a few seconds. The slow decays over the duration.\n", "Upon hitting an enemy, reaching maximum range or being reactivated, the bolt splits in two: each traveling in opposite directions perpendicular to the direction of cast. Each of the secondary bolts deal magic damage and slow the first enemies they hit, respectively.\n", "Additional Information:\n", "\n", "\n", "Vel'Koz stores a charge of Void Rift every few seconds and can store up to 2 charges. The recharge time is affected by cooldown reduction.\n", " Vel'Koz opens a rift to the void that cuts through the ground in a line, dealing magic damage and leaving behind a trail. ", ", the entire trail detonates, dealing magic damage to enemies standing upon it.\n", "Additional Information:\n", "\n", "\n", " Vel'Koz hurls an anomaly at the target location. When it lands, it collapses, dealing magic damage and suspending enemies hit for  0.", " seconds. Enemies close to Vel'Koz at the time of impact are also slightly knocked back.\n", "Additional Information:\n", "\n", "\n", " Vel'Koz roots himself in place and unleashes a laser forward in a line, damaging all enemies caught in its wake at 0.", " second intervals and slowing them by 20% for 1 second. The ray's trajectory will update over the duration to face the cursor and will end after either 2.", " seconds have elapsed or Vel'Koz recasts the ability.\n", "Organic Deconstruction can not be applied more frequently than once every 0.", " seconds.\n", "Additional Information:\n", "\n", "\n", "\n\t", "\n\tYou can find discussions about everything related to this wiki on "]},
{"url": "http://leagueoflegends.wikia.com/wiki/Talon", "urldoc": ["Talon", "the Blade's Shadow", " ", " ", " or ", " ", " ", " ", "Release date", "Talon's autoattacks deal 10% additional damage to any target that is slowed, stunned, immobilized or suppressed.\n", "\n", " Talon's next autoattack within the next 6 seconds deals bonus physical damage. If the target is a champion they will also bleed for 6 seconds, granting sight of their location to Talon and taking additional physical damage each second for the duration.\n", "Additional Information:\n", "\n", " Talon sends out a volley of daggers in a cone that then quickly return back to him, dealing physical damage to any enemies it passes through. Each enemy can only be damaged once at the start of the ability and once at the end. Additionally the enemy is slowed for 2 seconds, refreshing the duration of the slow if they are hit twice.\n", "Additional Information:\n", "\n", " Talon instantly appears behind his target, silencing them for 1 second and amplifying his damage against that target for 3 seconds.\n", "\n", " Talon disperses blades outwards in a 500-radius ring and gains stealth for up to 2.5 seconds while gaining 40% movement speed. When Talon emerges from stealth, the blades converge on his location. When the ring of blades expands and contracts, enemies hit receive physical damage. Each enemy can only be damaged once at the start of the ability and once at the end.\n", "Additional Information:\n", "\n"]},
{"url": "http://leagueoflegends.wikia.com/wiki/Vi", "urldoc": ["Vi", "the Piltover Enforcer", " ", " ", " or ", " ", " ", " ", "Release date", "When Vi's activated abilities damage an enemy, she gains a shield which absorbs damage equal to ", " for 3 seconds.\n", "Additional Information:\n", "\n", "\n", " Vi begins gathering energy into her gauntlet, increasing damage and dash range over 1.", " seconds. While in this state Vi cannot attack or use her other abilities, and her movement speed is slowed by 15%.\n", " Vi dashes towards the cursor's location, dealing physical damage and applying ", " to all enemies hit. Vi stops upon colliding with an enemy champion, knocking it back. Vault Breaker deals 75% damage to minions and monsters.\n", " Every third attack on the same target deals additional physical damage equal to a percentage of the target's maximum health, reduces the target's armor by 20%, and grants Vi bonus attack speed for 4 seconds. ", " deals a maximum of 300 damage against minions and monsters.\n", "Additional Information:\n", "\n", " Causes Vi's next basic attack to deal increased physical damage, hitting all enemies in a cone behind the target. Vi gains a new charge of ", " periodically (this reload time is reduced by cooldown reduction) and can hold up to 2 charges at once.\n", "Additional Information:\n", "\n", " Vi targets an enemy champion and chases it down. She performs an uppercut upon reaching it, dealing physical damage and knocking it up for 1.", " seconds.\n", "While charging, Vi is immune to crowd control and will knock aside enemies in her way, dealing 75% damage to them.\n", "\n"]},
{"url": "http://leagueoflegends.wikia.com/wiki/Warwick", "urldoc": ["Warwick", "the Blood Hunter", " ", " ", " or ", " ", " ", " ", "Release date", "Each of Warwick's autoattacks deal ", " / ", " / ", " / ", " / ", " / ", " / ", " / ", " / ", " / ", " / ", " / ", " / ", " / ", " / ", " / ", " / ", " / ", " (2.5 + ", " / ", " at each level) additional magic damage and heal him for the same amount. Each successive attack against the same target will stack this amount of healing and damage up to a maximum of 3 stacks. The stacks remain for 4 seconds.\n", "Additional Information:\n", "\n", " Warwick swipes at a target enemy, dealing magic damage for the greater value between a flat minimum amount or a percentage of the target's maximum health, plus additional bonus damage based on his ability power. Hungering Strike can only deal the flat damage to minions and monsters.\n", "Warwick heals himself for 80% of the damage dealt (after reductions).\n", "Additional Information:\n", "\n", " For 10 seconds, Warwick increases his attack speed and increases the attack speeds of all allies within range by half as much.\n", "Additional Information:\n", "\n", " Warwick reveals enemy champions within range with less than 50% health. While any enemies are revealed this way, Warwick has increased movement speed.\n", "Additional Information:\n", "\n", " Warwick blinks to the front of an enemy champion and channels for 1.", " seconds, suppressing the target for 1.", " seconds and dealing magic damage 5 times in 1/3-second intervals. Warwick gains 30% life steal for the duration. Each damaging strike applies on-hit effects, life steal, and maximum stacks of ", ".\n", "Spelleffects ", "\n", "Additional Information:\n", "\n", "\n", "\n\t", "\n\tYou can find discussions about everything related to this wiki on "]},
{"url": "http://leagueoflegends.wikia.com/wiki/Xerath", "urldoc": ["Xerath", "the Magus Ascendant", " ", " ", " or ", " ", " ", " ", "Release date", "Every 12 seconds, Xerath's next basic attack will restore ", " / ", " / ", " / ", " / ", " / ", " / ", " / ", " / ", " / ", " / ", " / ", " / ", " / ", " / ", " / ", " / ", " / ", " (27 + ", " / ", " / ", " / ", " / ", " at each level) mana. The amount of mana restored is doubled if the attack target is a champion. This does not apply to structures.\n", "Additional Information:\n", "\n", "\n", " Xerath starts charging, gradually increasing the range of Arcanopulse while decreasing his movement speed by up to 50% over the next 1.", " seconds.\nWhile charging, Xerath cannot attack or use his other abilities. ", ", Arcanopulse cancels and half the mana cost is refunded.\n", " After a brief cast time, Xerath fires a beam of energy in a line that deals magic damage to all enemies hit.\n", "Additional Information:\n", "\n", "\n", " Xerath calls down a blast of arcane energy which strikes after a 0.", " second delay, dealing magic damage and slowing enemies in a target 200-radius area by 10% for 2.", " seconds. Enemies hit directly take an empowered amount of damage and are slowed by a greater amount instead. The empowered slow decays down to 10% over the duration.\n", "Additional Information:\n", "\n", "\n", " Xerath fires a orb of energy forward in a line that detonates on striking an enemy, dealing magic damage and stunning them for between 0.", " and 2 seconds. The stun duration increases as the orb travels.\n", "\n", " Xerath anchors himself to his current location for up to 10 seconds. While anchored, Xerath is immune to displacement effects and gains the ability to cast Arcane Barrage up to three times, but cannot cast his other abilities. \n", "Rite of the Arcane can be cancelled early by moving or attacking and will automatically end once Arcane Barrage has been cast 3 times. If Rite of the Arcane ends without using a single cast of Arcane Barrage, the cooldown is reduced by 50%. Interrupting crowd control effects, with the exception of displacement effects, will interrupt Rite of the Arcane and put if on full cooldown.\n", " Xerath calls down a blast of arcane energy which strikes after a 0.", " second delay, dealing magic damage to enemies within a moderate area.\n", "Arcane Barrage is a ", " ability.\n", "Additional Information:\n", "\n", "\n"]},
{"url": "http://leagueoflegends.wikia.com/wiki/Vladimir", "urldoc": ["Vladimir", "the Crimson Reaper", " ", " ", " or ", " ", " ", " ", "Release date", " is a ", " in ", ".", "\n", "Vladimir gains ability power equal to ", " and bonus health equal to ", ". These bonuses do not stack with themselves.\n", "Additional Information:\n", "\n", " Vladimir drains the lifeforce of his target, dealing magic damage and healing himself.\n", "Additional Information:\n", "\n", "\n", " Vladimir sinks into a pool of blood, gaining 37.", "% bonus movement speed that decays exponentially for 1 second and becoming untargetable for 2 seconds. Enemies who stand upon the pool are slowed by 40%, and are dealt magic damage every half second while Vladimir heals himself for 12.", "% of the damage done.\n", "Additional Information:\n", "\n", " Vladimir unleashes a torrent of blood, damaging all enemies within range.\n", "Each cast of Tides of Blood gives him an Empowered stack that lasts 10 seconds and stacks up to 4 times. Each Empowered stack increases Vladimir's healing and regeneration by a percentage, and also increases both the base damage", " and cost of his next Tides of Blood by 25% per stack.\n", "Additional Information:\n", "\n", " Vladimir infects all enemies in the target 175-radius area with a virulent plague which increases the damage they take from all sources by 12% for 5 seconds. After these 5 seconds, infected enemies take magic damage.\n", "Additional Information:\n", "\n"]},
{"url": "http://leagueoflegends.wikia.com/wiki/Volibear", "urldoc": ["Volibear", "the Thunder's Roar", " ", " ", " or ", " ", " ", " ", "Release date", " is a ", " in ", ".", "\n", "When Volibear's health drops below 30% of his maximum health, he will heal for ", " over the next 6 seconds.\n", "Additional Information:\n", "\n", "\n", " Volibear gains 15% movement speed for the next 4 seconds. This bonus increases when headed toward a nearby visible enemy champion. Additionally, Volibear's next autoattack during this time will deal bonus physical damage and will toss the target behind himself.\n", "Additional Information:\n", "\n", "\n", " Volibear temporarily gains bonus attack speed after an autoattack. This bonus stacks up to 3 times and lasts for 4 seconds.\n", " While Volibear has 3 stacks of Frenzy, he can activate this ability to bite a target enemy. The stacks are not consumed. The bite will deal physical damage that scales with his own bonus health. This damage is further increased by 1% for every 1% of the target's missing health.\n", "\n", " Volibear lets out a powerful roar that deals magic damage and slows nearby enemies for 3 seconds. Minions, monsters and pets are also feared for the duration.\n", "Additional Information:\n", "\n", "\n", " For the next 12 seconds, Volibear's autoattacks will blast his target with lightning that will also bounce to up to 3 nearby enemies within 300 range. Each bolt of lightning will deal magic damage and will only hit each target once per autoattack.\n", "Additional Information:\n", "\n", "\n", "\n\t", "\n\tYou can find discussions about everything related to this wiki on "]},
{"url": "http://leagueoflegends.wikia.com/wiki/Yorick", "urldoc": ["Yorick", "the Gravedigger", " ", " ", " or ", " ", " ", " ", "Release date", " is a ", " in ", ".", "\n", "Yorick takes 5% less damage and his basic attacks deal 5% more damage for each of his active summons. All of Yorick's basic abilities summon a Ghoul and Omen of Death summons a Revenant.\n", " Ghouls last for 5 seconds. Their health and damage are calculated from Yorick's totals. They also have special effects determined by the ability used to summon them.\n", "Additional Information:\n", "\n", " Yorick's next basic attack within 10 seconds will deal bonus physical damage and summon a Spectral Ghoul.\n", " Has higher attack damage than other Ghouls. Grants itself and Yorick a movement speed buff.\n", "Additional Information:\n", "\n", "\n", " Yorick summons a Decaying Ghoul that arrives with a violent explosion, dealing magic damage in a 100-radius area and slowing enemies hit for 1.5 seconds.\n", " Has a 62.5-radius aura that slows nearby enemies.\n", "Additional Information:\n", "\n", " Yorick steals life from his target, dealing magic damage, healing himself for 40% of the damage dealt and summoning a Ravenous Ghoul behind them.\n", " Heals Yorick with each attack. This effect is halved when attacking minions and monsters.\n", "Additional Information:\n", "\n", "\n", " Yorick conjures a Revenant in the image of an allied champion. If that ally takes lethal damage before the Revenant dies, the Revenant sacrifices itself to reanimate them and give them 10 seconds to enact vengeance.\n", " A Revenant lasts 10 seconds. It has health and attack damage calculated from the target's totals. It can be controlled by holding the alt key and using the right mouse button or by reactivating this ability.\n", "Additional Information:\n", "\n", "\n", "\n", "\n", "\n", "\n", "\n\t", "\n\tYou can find discussions about everything related to this wiki on "]},
{"url": "http://leagueoflegends.wikia.com/wiki/Wukong", "urldoc": ["Wukong", "the Monkey King", " ", " ", " or ", " ", " ", " ", "Release date", " is a ", " in ", ".", "\n", "Wukong's armor and magic resistance are increased by ", " / ", " / ", " for each visible nearby enemy champion.\n", "Additional Information:\n", "\n", " Wukong's next attack within the next 5 seconds deals bonus physical damage, gains 125 range (300 total range) and reduces the enemy's armor by 30% for 3 seconds.\n", "Additional Information:\n", "\n", " Wukong becomes stealthed for 1.", " seconds and leaves behind a decoy of himself.\n", " The decoy is uncontrollable and cannot move or attack. After 1.", " seconds, it will vanish, dealing magic damage in a radius of 175.\n", "Additional Information:\n", "\n", " Wukong dashes on a cloud toward a target enemy and sends out images to hit up to two more within 187.5 range of the target. Each enemy struck is dealt physical damage. Upon hitting his target, he gains an attack speed bonus for 4 seconds.\n", "\n", " Wukong's staff grows outward as he spins around for up to 4 seconds, dealing physical damage per second to enemies around him and gaining a 5% move speed bonus per half second. Enemies are knocked up into the air the first time they are hit by the spin. Wukong cannot attack or use other basic abilities while spinning, but can deactivate it early.\n", "Additional Information:\n", "\n", "\n", "\n\t", "\n\tYou can find discussions about everything related to this wiki on "]},
{"url": "http://leagueoflegends.wikia.com/wiki/Zac", "urldoc": ["Zac", "the Secret Weapon", " ", " ", " or ", " ", " ", " ", "Release date", "Each time Zac uses an ability on enemies, he sheds a chunk of himself to a nearby location. Zac can move over these chunks to reabsorb them, regaining ", ". Enemies may move over these chunks to destroy them.\n", "Upon taking fatal damage, Zac splits into 4 bloblets that attempt to recombine. Each bloblet has ", ", and 50% of his armor and magic resistance. If any of these bloblets remain after 8 seconds, Zac will revive with 10-50% health depending on the health of the surviving chunks.\n", "Additional Information:\n", "\n", "\n", "\n", " Zac lashes out with an elastic punch, dealing magic damage to enemies in a line and slowing them for 2 seconds.\n", "\n", " Zac's body explodes outward, dealing magic damage equal to a base amount plus a percentage of their maximum health to all nearby enemies (max 200 damage against minions and monsters).\n", "Additional Information:\n", "\n", " Zac faces the cursor and begins channeling. After channeling or after reactivating the ability he launches himself towards the target location, dealing magic damage to all enemies hit and knocking them back for 0.", " seconds. The range of Elastic Slingshot increases based on how long Zac channels.\n", "Can be cancelled by moving, refunding 50% of the health cost and halving the cooldown.\n", "Additional Information:\n", "\n", " Zac leaps into the air and begins to bounce on the ground, up to a maximum of 4 bounces. Each bounce deals magic damage to nearby enemies upon impact, knocks them up for 1 second, and slows them by 20% for 1 second. Enemies hit more than once take half damage and are not knocked up. \n", "Zac gains an accelerating movement speed buff (20-50%) while bouncing. During this time, Zac can still move and use ", ", but is unable to activate ", " or ", ".\n", "Additional Information:\n", "\n"]},
{"url": "http://leagueoflegends.wikia.com/wiki/Ziggs", "urldoc": ["Ziggs", "the Hexplosives Expert", " ", " ", " or ", " ", " ", "Release date", " is a ", " in ", ".", "\n", "Every 12 seconds, Ziggs' next basic attack deals ", " / ", " / ", " / ", " / ", " / ", " / ", " / ", " / ", " / ", " / ", " / ", " / ", " / ", " / ", " / ", " / ", " / ", " (16 + ", " / ", " / ", " at each level) ", " bonus magic damage. The cooldown is reduced by 4 seconds whenever Ziggs uses an ability but not from other sources of cooldown reduction. Short Fuse deals 50% bonus (150% total) damage to enemy structures.\n", "\n", " Ziggs throws a bouncing bomb to a target area. If the bomb contacts an enemy or bounces three times then it explodes, dealing magic damage in an area. The distance of each bounce is dependent on how far it was originally thrown.\n", "Additional Information:\n", "\n", "\n", " Ziggs flings an explosive charge to the target area. The charge gives sight nearby and detonates after 4 seconds or when this ability is activated again. The explosion deals magic damage and enemies hit are knocked away. Ziggs is also knocked away, but takes no damage.\n", "Additional Information:\n", "\n", "\n", " Ziggs scatters 11 proximity mines that detonate on enemy contact, dealing magic damage and slowing the enemy for 1.", " seconds. Enemies take 40% damage for each mine they detonate beyond the first. Mines disarm automatically after 10 seconds.\n", "Additional Information:\n", "\n", "\n", " Ziggs deploys his ultimate creation, the Mega Inferno Bomb, hurling it an enormous distance. Enemies in the primary blast zone take full magic damage (double damage to minions, but not monsters) while those further away take 80%.\n", "Additional Information:\n", "\n", "\n", "\n\t", "\n\tYou can find discussions about everything related to this wiki on "]},
{"url": "http://leagueoflegends.wikia.com/wiki/Viktor", "urldoc": ["Viktor", "the Machine Herald", " ", " ", " or ", " ", " ", "Release date", "Viktor starts each game with ", ", an item that takes up one of his item slots, but provides him with stats and can be upgraded in the store to augment one of his abilities and improve its stats. The Hex Core can only be upgraded once, for 1000 gold, and cannot be sold back to the store.\n", ": Grants Viktor ", ".\n", " Viktor sends a device at an enemy unit to blast them for magic damage. The device then returns to him granting a shield for up to 3 seconds.\n", "The item now grants him +3 ability power per level, +220 health and +6 health regeneration per 5 seconds. Also, Power Transfer increases Viktor's movement speed by 30% for 3 seconds.\n", " 2000\n", "Additional Information:\n", "\n", "\n", " Viktor conjures a gravitational imprisonment device in an area near him, slowing all enemies that pass above it. Whilst under its effect, enemies generate stacks every 0.", " seconds; at 3 stacks the target will be stunned for 1.", " seconds.\n", "The item now grants him +3 ability power per level, +200 mana, +10% cooldown reduction and +5 mana regeneration per 5 seconds. Also, Gravity Field's cast range is increased by 30%.\n", "Additional Information:\n", "\n", "\n", " Viktor uses his robotic arm to fire a 500-unit length laser beam across the field in a chosen path, dealing magic damage to every enemy it hits.\n", "The item now grants him +3 ability power per level and +45 ability power. Also, Death Ray sets fire to enemies, dealing 30% additional magic damage over 4 seconds.\n", "Additional Information:\n", "\n", "\n", " Viktor conjures a chaos storm at the target location, dealing magic damage and silencing enemies in the area for 0.", " seconds. The storm cloud remains for 7 seconds afterwards, firing lightning bolts at every nearby enemy every second.\n", "While the storm is active Viktor can re-activate Chaos Storm to move it to the cursor's location, with the storm moving faster the closer it is to Viktor.\n", "Additional Information:\n", "\n", "\n", "\n\t", "\n\tYou can find discussions about everything related to this wiki on "]},
{"url": "http://leagueoflegends.wikia.com/wiki/Zilean", "urldoc": ["Zilean", "the Chronokeeper", " ", " ", " or ", " ", " ", " ", "Release date", " is a ", " in ", ".", "\n", "Increases experience gain of all allied champions by 8%. This bonus is unavailable while Zilean is dead.\n", "Additional Information:\n", "\n", "\n", " Zilean places a ticking time bomb on any unit, allied or enemy, which detonates after 4 seconds, dealing magic damage in a 330-unit area. Bombs will detonate immediately if the holder dies or if another bomb is placed on them.\n", "An exploding bomb is an ", " at its last location.\n", "Additional Information:\n", "\n", "\n", " Zilean reduces the cooldowns of all of his other abilities by 10 seconds.\n", "Additional Information:\n", "\n", "\n", " Zilean bends time around a champion, slowing an enemy champion or increasing an ally champion's movement speed by 55% for a short time.\n", "\n", " Zilean places a protective time rune on an allied champion for 7 seconds. If the target takes lethal damage during that time, they  will be placed in stasis - making them untargetable and invulnerable. After 2 seconds, the target is revived with a set amount of health.\n", "Additional Information:\n", "\n", "\n", "\n\t", "\n\tYou can find discussions about everything related to this wiki on "]},
{"url": "http://leagueoflegends.wikia.com/wiki/Zyra", "urldoc": ["Zyra", "Rise of the Thorns", " ", " ", " or ", " ", " ", " ", "Release date", "(+20% AP)", "(+20% AP)", " is a ", " in ", ".", "\n", "Upon death, Zyra returns to her plant form for up to 8 seconds. After 2 seconds, she can use any ability to fire a Vengeful Thorn in a line towards the cursor, dealing 80 ", " true damage to every enemy it passes through.\n", "Additional Information:\n", "\n", "\n", " After a ", ", thorns shoot from the ground at a target location, dealing magic damage to enemies within the area.\n", " If Deadly Bloom hits a seed, a Thorn Spitter grows that lasts for 10 seconds. Thorn Spitters have a long ranged attack and deal 23 + (6.", " × level) ", " magic damage.\n", "\n", " Grants bonus cooldown reduction.\n", " Plants a seed at a target point for 30 seconds, granting sight of a small area around it. Zyra generates seeds over time, can hold up to 2 seeds, and cannot plant more than 4 seeds at a time.\n", "After 1.", " seconds, if an enemy champion steps on a seed, it will be destroyed, but they will be revealed by true sight for 2 seconds.\n", "If Zyra's spells hit a seed they will sprout into a plant, automatically attacking nearby enemies for 10 seconds. Plant damage is based on Zyra's level. Extra plants striking the same target deal 50% less damage.\n", "Additional Information:\n", "\n", "\n", " Sends vines forward in a line, dealing magic damage and rooting enemies hit for a short duration.\n", " If Grasping Roots hits a seed, a Vine Lasher grows that lasts for 10 seconds. Vine Lashers have a short ranged attack that deals 23 + (6.", " × level) ", " magic damage and slows enemies hit by 30% for 2 seconds.\n", "\n", " Summons the fury of nature, growing a twisted thicket at the target location which deals magic damage to all enemies in the area as it expands. After 2 seconds, the vines snap upward knocking enemies into the air for 1 second.\n", " Plants within the thicket are enraged, increasing their attack speed by 50%.\n", "Additional Information:\n", "\n", "\n", "\n", "\n", "\n", "\n"]},
{"url": "http://leagueoflegends.wikia.com/wiki/Xin_Zhao", "urldoc": ["Xin Zhao", "the Seneschal of Demacia", " ", " ", " or ", " ", " ", " ", "Release date", " is a ", " in ", ".", "\n", "Basic attacks and Audacious Charge challenge Xin Zhao's target, reducing their armor by 15% for 3 seconds. Only one target can be affected by Challenge at any time.\n", "\n", " Xin Zhao's next 3 basic attacks deal bonus physical damage and reduce his other abilities' cooldowns by 1 second each. The third strike also knocks the target into the air for 1 second.\n", "Additional Information:\n", "\n", " Xin Zhao heals himself on every third basic attack.\n", "\n", " Xin Zhao increases his attack speed for 5 seconds.\n", "Additional Information:\n", "\n", " Xin Zhao charges at an enemy, dealing magic damage to all enemies within 112.", " range and slowing them for 2 seconds.\n", "Additional Information:\n", "\n", " Xin Zhao unleashes a sweep around him, knocking enemies back and dealing physical damage equal to a base amount plus 15% of their current health (capped at  600 against monsters). Xin Zhao gains bonus armor and magic resistance for each champion struck, lasting for 6 seconds.\n", "Crescent Sweep will not knock back the enemy currently affected by ", ".\n", "\n", "\n\t", "\n\tYou can find discussions about everything related to this wiki on "]},
{"url": "http://leagueoflegends.wikia.com/wiki/Zed", "urldoc": ["Zed", "the Master of Shadows", " ", " ", " or ", " ", " ", " ", "Release date", " is a ", " in ", ".", "\n", "Zed's basic attacks against targets below 50% health deal ", " as bonus magic damage. This effect can only occur once every 10 seconds on the same target.\n", "\n", " Zed throws his spinning blades forward, dealing physical damage to the first enemy they pass through and 60% damage to enemies thereafter.\n", " Active shadows will also throw a shuriken in the direction of the target point. Additional shuriken striking the same enemy deal 50% damage and restore energy.\n", "Additional Information:\n", "\n", "\n", " Zed's bonus attack damage is increased by a percentage.\n", " Zed's shadow dashes forward, remaining in place for 4 seconds. Reactivating Living Shadow will cause Zed to swap places with this shadow.\n", " Zed's shadows mimic his basic abilities. If a target is struck twice by a mimicked ability, Zed restores some energy. Energy can only be restored once per mimicked cast.\n", "Additional Information:\n", "\n", "\n", " Zed spins his blades, creating a burst of shadow energy and dealing physical damage to nearby enemies. Each enemy champion hit reduces Living Shadow's cooldown by 2 seconds.\n", " Active shadows also slash, dealing physical damage to nearby enemies and slowing them for 1.", " seconds. Enemies hit by both slashes are slowed more and restore energy but will not take additional damage.\n", "Additional Information:\n", "\n", "\n", " Zed becomes untargetable for 0.", " seconds and dashes to the target enemy champion. Upon arrival, he marks the target for death and spawns a shadow that lasts for 6 seconds at the cast location. Reactivating Death Mark will cause Zed to swap places with this shadow.\n", "After 3 seconds, Death Mark will trigger, dealing flat physical damage plus a percentage of all physical and magic damage dealt to the marked champion while it was active.\n", "Additional Information:\n", "\n", "\n", "\n\t", "\n\tYou can find discussions about everything related to this wiki on "]},
{"url": "http://leagueoflegends.wikia.com/wiki/Yasuo", "urldoc": ["Yasuo", "the Unforgiven", " ", " ", " or ", " ", " ", " ", "Release date", "Yasuo's abilities have no cost related to them and their use is limited only by cooldowns. His secondary resource bar tracks his unique mechanic: Flow.", "\n", "Yasuo can have up to ", " / ", " / ", " / ", " / ", " / ", " / ", " / ", " / ", " / ", " / ", " / ", " / ", " / ", " / ", " / ", " / ", " / ", " Flow. Yasuo generates 1% of his maximum Flow with every 46 units he travels, requiring a total of ", " to obtain maximum Flow. Flow does not decay or generate idly. As Flow generation is based on distance travelled, it is also accumulated while dashing, teleporting or when displaced by crowd control effects. \n", " Yasuo's critical strike chance is doubled, but the damage dealt by his critical strikes is reduced by 10% (25% on Steel Tempest).\n", " At maximum Flow, the next time Yasuo would take damage from a champion or monster he first converts his Flow into a shield that absorbs damage. After 1.5 seconds, if not already depleted, Yasuo loses all his Flow.\n", "Additional Information:\n", "\n", "Consecutive successful casts of Steel Tempest within 10 seconds form a chain.\n", "\n", "\n", "\n", "Steel Tempest can critically strike, having a 25% damage penalty.  Without any additional critical damage the bonus damage equals ", ". Additionally, on-hit effects will be applied to the first enemy hit within 475-unit range. The cooldown and cast time of Steel Tempest is reduced based on Yasuo's bonus attack speed and unaffected by cooldown reduction.\n", "Additional Information:\n", "\n", " Yasuo generates a percentage of his maximum Flow whenever he uses ", " in addition to the amount that is generated for the distance moved.\n", " Yasuo creates a gust of wind that travels forward to form a wall 400 units away from himself. The wall slowly drifts forward over 3.", " seconds, blocking all enemy projectiles with the exception of tower hits.\n", "Additional Information:\n", "The following projectiles pass through ", " (possible bugs):\n", "The following projectiles are not destroyed when they hit ", ":\n", "The following projectiles are ", " when they hit ", ":\n", "\n", " Yasuo dashes 475 units in the direction of the target enemy, dealing magic damage and marking them briefly. The speed of the dash scales with Yasuo's bonus movement speed.\n", "Each cast increases the next dash's base damage by 25% for 5 seconds, up to 100% bonus damage. Yasuo cannot use Sweeping Blade on an enemy that's already been marked.\n", "Additional Information:\n", "\n", " Yasuo blinks to the nearest visible airborne enemy champion to the cursor, instantly generating maximum Flow. Upon arriving, he suspends all airborne units within a 400-radius of his target in the air for 1 second while dealing physical damage to all of them. Once he lands, Yasuo gains 50% penetration to ", " armor for 15 seconds.\n", "Casting Last Breath will reset the chain on Steel Tempest.\n", "Additional Information:\n", "The following abilities are not classified as airborne or are specifically excluded: \n", "\n", "\n\t", "\n\tYou can find discussions about everything related to this wiki on "]}]